{"id": 0, "text": "Independent School for Girls in London, Private Girls School - More House An independent day school for girls aged 9 to 18 in the heart of Knightsbridge, London A Path to Success: Celebrating Individual Journeys, Championing Extraordinary Outcomes Welcome to More House: A place where lives are transformed and purpose is ignited. Nestled in the heart of Knightsbridge, our creative-thinking Catholic school empowers girls aged 9-18 to become the ethical leaders the world needs. We believe in nurturing not just intellect, but also shaping young women to lead with integrity and compassion. Museum of Brands, W11, V & A and Design Museum Business location mapping (Local roads in Chelsea and Knightsbridge) Customer service secret shopper activity. Location for a Year 9 Urban Studies assignment. Sixth form explore the development of Science and biotechnology experiments. Students attend talks and workshops on the latest geographical research. Students explore French literature, watch French films at the Ciné Lumière and discover French culture via their festivals and cultural events throughout the year. German students attend language classes and both cultural and cinema events. Spanish students can access language classes, courses, theatre, cinema, music and competitions, either on-site or online. EPQ students visit the Senate House Library to learn more about using academic sources and to carry out independent research. Faith in Action has championed the work of SVP by raising awareness and money for the work of the organisation. Confirmation candidates go here on a Sunday evening to set up dinner for the homeless people. Faith in Action has carried out some invaluable fundraising activities to support the great work of the Cardinal Hume Centre. Pupils visit the synagogue to refresh their GCSE knowledge. We visit the Nuns of Tyburn Convent whose lives are centred on Eucharistic Adoration for the glory of God and also on prayer for the human family. We often walk down to the Cathedral to light candles and offer prayers in this lovely sanctuary and some of our girls are confirmed here. St Mary’s Church hosts our whole School Masses and faith enrichment evenings."}
{"id": 1, "text": "Visited when learning about photography and to see new artist’s work. Used in art for drawing from direct observation. Used in art for drawing from direct observation. Girls learn about Art History and conservation. Access to cutting edge scientific research for Geography topics and for KS3 pupils to explore the Wonder Lab in Science. Maths students visit the Winton Gallery to explore how mathematics has shaped our world from war and peace to life, death, money, trade and beauty. Visited for art, textiles, geography, biology, physics and chemistry. Students explore the medicinal properties of plant. Geographers can explore the carbon and water cycles, ecosystems, create resources and develop field work skills in Geography and is used for our Ecology day out in Science. Study breaks and walks for sixth formers. Climbing wall and state of the art Gym facilities. Badminton and basketball are played here. Curricular and co-curricular sport takes place here, as well as our annual Sports Day. Girls attend workshops, exhibitions and art talks. Girls attend workshops, exhibitions and art talks. One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama. We are proud of our Catholic heritage and . Our mission gives us a spiritual depth that benefits each of our girls and forms the foundation of More House offers a bespoke education that is future-focussed, preparing young women to be the ethical leaders of tomorrow. Our academic philosophy is underpinned by trust and strong teacher-pupil relationships. We know our girls well and support them in succeeding both in and out of the classroom."}
{"id": 2, "text": "More House School has an outstanding reputation for its exceptional pastoral care, which is built on a foundation of respect, compassion and dignity in all interactions between staff, pupils and parents. Pupils are nurtured and guided closely by staff, in order to become resilient, confident and inspiring young women. Open post by 22morehouse with ID 18279715420261471 ✨And just like that, another academic year comes to an end! ✨ What a wonderful day of celebrations it has been! From delicious donuts for those with 100% attendance this term and all year round, to academic awards, sports achievements and special recognitions for students whose growth mindset has helped them excel in every area. We can not forget the House Competition, see the post before! To say we are proud of our girls would be an understatement. We wish all our families a fantastic summer ahead. 🌞 Stay tuned over the break as we share some of our favourite highlights from years past! Open post by 22morehouse with ID 18143866267397808 This year’s House Entertainment Competition was a spectacular showcase of talent and teamwork, with each house bringing a music genre to life: Country, Electronic, Pop and Rock. From high energy dance numbers, creative acting and even gymnastics, the girls wowed us with their imagination and dedication. The school was filled with laughter, cheering and the buzz of friendly competition. A huge congratulations to Santiago, our well deserved winners, for their outstanding performance! Well done to all the houses: you made us proud! Open post by 22morehouse with ID 18361784419150300 Everyone who attended will surely agree that this year’s Summer Concert was nothing short of phenomenal. The girls performed beautifully, with confidence and flair, and the evening proved to be a truly enjoyable community affair. Open post by 22morehouse with ID 18069928214026832 This time last week, all paths led to @ogniskorestaurant as the More House Parents Association hosted a truly unforgettable evening! A huge thank you to everyone who came along and supported the event, your generosity and enthusiasm made it a night to remember."}
{"id": 3, "text": "A heartfelt thank you to @ogniskorestaurantfor for sponsoring the event, the food and drinks were delicious! 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 4, "text": "Independent School for Girls in London, Private Girls School - More House An independent day school for girls aged 9 to 18 in the heart of Knightsbridge, London A Path to Success: Celebrating Individual Journeys, Championing Extraordinary Outcomes Welcome to More House: A place where lives are transformed and purpose is ignited. Nestled in the heart of Knightsbridge, our creative-thinking Catholic school empowers girls aged 9-18 to become the ethical leaders the world needs. We believe in nurturing not just intellect, but also shaping young women to lead with integrity and compassion. Museum of Brands, W11, V & A and Design Museum Business location mapping (Local roads in Chelsea and Knightsbridge) Customer service secret shopper activity. Location for a Year 9 Urban Studies assignment. Sixth form explore the development of Science and biotechnology experiments. Students attend talks and workshops on the latest geographical research. Students explore French literature, watch French films at the Ciné Lumière and discover French culture via their festivals and cultural events throughout the year. German students attend language classes and both cultural and cinema events. Spanish students can access language classes, courses, theatre, cinema, music and competitions, either on-site or online. EPQ students visit the Senate House Library to learn more about using academic sources and to carry out independent research. Faith in Action has championed the work of SVP by raising awareness and money for the work of the organisation. Confirmation candidates go here on a Sunday evening to set up dinner for the homeless people. Faith in Action has carried out some invaluable fundraising activities to support the great work of the Cardinal Hume Centre. Pupils visit the synagogue to refresh their GCSE knowledge. We visit the Nuns of Tyburn Convent whose lives are centred on Eucharistic Adoration for the glory of God and also on prayer for the human family. We often walk down to the Cathedral to light candles and offer prayers in this lovely sanctuary and some of our girls are confirmed here. St Mary’s Church hosts our whole School Masses and faith enrichment evenings."}
{"id": 5, "text": "Visited when learning about photography and to see new artist’s work. Used in art for drawing from direct observation. Used in art for drawing from direct observation. Girls learn about Art History and conservation. Access to cutting edge scientific research for Geography topics and for KS3 pupils to explore the Wonder Lab in Science. Maths students visit the Winton Gallery to explore how mathematics has shaped our world from war and peace to life, death, money, trade and beauty. Visited for art, textiles, geography, biology, physics and chemistry. Students explore the medicinal properties of plant. Geographers can explore the carbon and water cycles, ecosystems, create resources and develop field work skills in Geography and is used for our Ecology day out in Science. Study breaks and walks for sixth formers. Climbing wall and state of the art Gym facilities. Badminton and basketball are played here. Curricular and co-curricular sport takes place here, as well as our annual Sports Day. Girls attend workshops, exhibitions and art talks. Girls attend workshops, exhibitions and art talks. One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama One of the many London Theatres visited as part of the study of English and Drama. One of the many London Theatres visited as part of the study of English and Drama. We are proud of our Catholic heritage and . Our mission gives us a spiritual depth that benefits each of our girls and forms the foundation of More House offers a bespoke education that is future-focussed, preparing young women to be the ethical leaders of tomorrow. Our academic philosophy is underpinned by trust and strong teacher-pupil relationships. We know our girls well and support them in succeeding both in and out of the classroom."}
{"id": 6, "text": "More House School has an outstanding reputation for its exceptional pastoral care, which is built on a foundation of respect, compassion and dignity in all interactions between staff, pupils and parents. Pupils are nurtured and guided closely by staff, in order to become resilient, confident and inspiring young women. Open post by 22morehouse with ID 18279715420261471 ✨And just like that, another academic year comes to an end! ✨ What a wonderful day of celebrations it has been! From delicious donuts for those with 100% attendance this term and all year round, to academic awards, sports achievements and special recognitions for students whose growth mindset has helped them excel in every area. We can not forget the House Competition, see the post before! To say we are proud of our girls would be an understatement. We wish all our families a fantastic summer ahead. 🌞 Stay tuned over the break as we share some of our favourite highlights from years past! Open post by 22morehouse with ID 18143866267397808 This year’s House Entertainment Competition was a spectacular showcase of talent and teamwork, with each house bringing a music genre to life: Country, Electronic, Pop and Rock. From high energy dance numbers, creative acting and even gymnastics, the girls wowed us with their imagination and dedication. The school was filled with laughter, cheering and the buzz of friendly competition. A huge congratulations to Santiago, our well deserved winners, for their outstanding performance! Well done to all the houses: you made us proud! Open post by 22morehouse with ID 18361784419150300 Everyone who attended will surely agree that this year’s Summer Concert was nothing short of phenomenal. The girls performed beautifully, with confidence and flair, and the evening proved to be a truly enjoyable community affair. Open post by 22morehouse with ID 18069928214026832 This time last week, all paths led to @ogniskorestaurant as the More House Parents Association hosted a truly unforgettable evening! A huge thank you to everyone who came along and supported the event, your generosity and enthusiasm made it a night to remember."}
{"id": 7, "text": "A heartfelt thank you to @ogniskorestaurantfor for sponsoring the event, the food and drinks were delicious! 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 8, "text": "We are proud of our Catholic heritage and ethos. Our mission gives us a spiritual depth that benefits each of our girls and forms the foundation of our community. Our More House School values are Commitment, Integrity and Compassion. Our pupils demonstrate a strong sense of justice and understanding of their place in the wider world. We welcome pupils of all faiths or none and encourage mutual respect and tolerance among our students and staff. We are a beautifully diverse School and celebrate the richness that this brings to More House’s Catholic faith isn’t just taught; it’s lived daily. We cultivate tolerant, just, and thoughtful girls who act with integrity. Daily prayer and weekly Chapel services build our community, celebrating St Thomas More’s Day and Days of Obligation. Our core charitable work, FIA empowers pupils to lead local and global change. FIA mobilises campaigns on climate change, homelessness, and more, partnering with CAFOD, The Cardinal Hume Centre, The WE Foundation, and other organisations. We foster global citizens through active campaigning and international projects, from Tanzanian support to initiatives in Cambodia and Ecuador. From the warmth of our local community to the awe-inspiring spaces of Notre Dame, Sacré Coeur, and the Vatican (where we performed for the beatification of Pope John Paul II), More House’s Music department travels the world, sharing our liturgy and creating memorable experiences. Our students, joined by alumni, bring a unique energy to every performance. At More House School, our mission is to cultivate an environment where pupils can excel academically, exhibit kindness in all that they do, develop essential life skills, and embrace their unique strengths and talents. We are a progressive Catholic school, welcoming pupils of all faiths and none and we actively celebrate our diversity as a community. More House School pupils are encouraged to be big thinkers, ethical leaders and active global citizens. Cultivate inspiring and successful young women by fostering Commitment, Integrity and Compassion Promote an ethos of spiritual development, humility and self-awareness, founded on the Catholic Faith but relevant to those who adhere to other faiths and beliefs, or none."}
{"id": 9, "text": "Engender a culture of intellectual curiosity both inside and outside of the classroom and pride in individual and collective achievement Provide for the social and emotional wellbeing and development of pupils and staff through tolerance, justice and openness in an environment where all are equally valued and where individual rights and dignity are respected Embrace the philosophy of Global Citizenship by developing an awareness and understanding of whole world sensitivities and the importance of living sustainably I strongly support the school, its contemporary Catholic ethos and everything you and your colleagues are doing for the students in all Year Groups, which is amazing. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 10, "text": "Discover the More House difference! We understand choosing the right school for your daughter can be a complex time, and we aim to make this part of the process as smooth as possible for you. As you step through our doors, you will immediately experience our small school environment, where every student is truly known and nurtured. We pride ourselves on our outstanding pastoral care, ensuring our students’ well-being is paramount. During your visit, you may see the focus and engagement in a dynamic science lesson or perhaps the collaborative problem-solving in a maths lesson. Beyond the core curriculum, as you journey through our corridors, you may hear the energy of drama rehearsals, see art studios buzzing with creativity, or find our students throwing themselves into all sorts of clubs and activities. For us, these enriching experiences, alongside our extensive co-curricular activities, are not just extras; they are woven into the very fabric of what we do here. Come and experience who we are by filling in the form below. Open Evening – Wednesday 17 September 2025 Kindly note that the scheduled times for all open mornings are 9:30am to 11:00am, and for all open evenings, 6:00pm to 7:30pm. If you would like to arrange a private tour and to meet with our Head, please contact our Director of Admissions and Marketing ( If you are looking for a place for your daughter in our Sixth Form, for an occasional place in another year group or if you missed the Year 7 entry process, please complete the enquiry form On behalf of everyone at More House, we are look forward to welcoming you soon. Saint Helena, Ascension and Tristan da Cunha South Georgia and the South Sandwich Islands Open Morning - Wednesday 18 June 2025: 9.30am - 11.00am Open Evening - Wednesday 17 September 2025: 6.00pm - 7.00pm Open Morning - Friday 10 October 2025: 9.30am - 11.00 am Please highlight your daughter's key interest (STEM, Sport, Drama, Arts) How did you hear about our Open Morning? (i.e. Good Schools Guide, Facebook, Instagram, etc)"}
{"id": 11, "text": "This field is for validation purposes and should be left unchanged. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 12, "text": "Launched in September 2024, our Pre-Senior Years cater to girls aged 9 to 11, providing a dedicated space for focused learning and growth. Our Year 5 and 6 Curriculum is designed to nurture their potential and ignite their curiosity, ensuring a confident transition into our Year 7 class. Recognising that a nine year old’s mind thrives on inspiration, More House cultivates a nurturing environment where each girl receives individual support. Our teachers are dedicated to kindling her curiosity and instilling a lifelong love of learning, laying a strong foundation for her transition to Year 7. At More House, our Years 5 and 6 girls follow the National Curriculum of English, Maths, Science, History, Geography, PSHE, Computing (ICT), Art, PE, Music and Modern Foreign Languages. Religious Studies is taught in accordance with the diocese’s planning framework. The ‘Even More Creative’ programme has been designed to inspire the children, enabling teachers to build upon the foundations learned in the classroom. By taking advantage of what’s on our doorstep, the children are able to explore a plethora of museums, galleries and outdoor spaces to include the National History Museum, Science Museum, Hyde Park, South Bank, and the Victoria & Albert Museum. Smaller class sizes and passionate, dedicated teachers create the perfect environment where every child can truly flourish. With individualised attention, each child isn’t just another face in the crowd; they are seen, heard, and valued. This approach fosters a profound sense of belonging, allowing children to feel secure and empowered as they navigate their unique learning journeys. Personalised learning plans cater to their strengths and interests, sparking curiosity and enthusiasm, ensuring every child not only meets but exceeds their potential, setting them up for a lifetime of success and confidence."}
{"id": 13, "text": "Our dedicated and compassionate pastoral team creates a nurturing and inclusive environment where every individual feels valued and supported. We offer a safe and welcoming space for emotional and social growth, encouraging self-expression and celebrating the unique qualities that make each person special. With a focus on personal development, we guide individuals through life’s challenges, providing them with the tools, empathy, and understanding they need to thrive. Our aim is to empower them to build resilience, confidence, and a sense of belonging, ensuring they have the support system necessary to navigate their personal journeys with strength and a positive approach. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 14, "text": "Step into our Senior School and you will immediately sense our vibrant and ambitious spirit. We believe in empowering girls to throw themselves wholeheartedly into every opportunity, whether that’s delving into advanced Arts projects, taking centre stage in our compelling drama productions, competing with House spirit in sporting events, or actively shaping our school community through pupil-led committees and societies. Beyond the Report Card – Celebrating Growth, Not Just Grades More House Senior School is committed to supporting each girl in achieving her personal best in her GCSEs and A Levels. Our true measure of success lies in the individual progress each student makes and the confidence she gains in her own learning journey. We actively encourage girls to celebrate their own achievements, understanding that effort and growth are just as valuable as the final grade. We know that a positive and empowering school experience is fundamental to building lifelong self-esteem and a belief in oneself as a capable individual, qualities we actively cultivate to ensure our pupils thrive both now and in their future lives. A Flourishing Environment, Where Individuality Thrives While we are proud of our students’ academic achievements, we believe in nurturing well-rounded individuals. Our rich and varied co-curricular programme, encompassing numerous clubs, trips, and opportunities for charitable and outreach work via More Faith. It’s a privilege to see our girls explore their diverse interests, uncover their unique talents, particularly within the creative and performing Arts,  embracing the joy of discovery. Our strong House system further enriches school life, fostering friendships across year groups and providing platforms for every girl to shine outside of the academic curriculum. Authentically More House, Warmth and Connection Visitors often remark on the genuine and comfortable nature of our girls. When they welcome prospective families on tours, they speak with sincerity and pride, sharing their own experiences of More House with genuine enthusiasm. This authentic connection beautifully illustrates the unique atmosphere of our school, where the relationships between staff and girls are characterised by warmth, friendliness, and mutual respect. Values that Shape Futures – Kindness, Integrity, Action"}
{"id": 15, "text": "We consistently encourage our girls to consider the positive impact they have on others, understanding that their worth extends far beyond academic accomplishments. We actively celebrate kindness and consideration, promote the highest standards of behaviour, and instil the importance of integrity and proactive engagement with the world around them. These core values are integral to our assemblies, tutor time, our expectations, and our daily interactions with each pupil. Our aim is to empower our girls to become confident, compassionate young women who will make a positive difference in the wider world. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 16, "text": "Sixth Form Programme London - More House School At More House, no two Sixth Form journeys are the same. We design a bespoke programme of study for every individual, ensuring each student thrives both academically and personally. Thanks to our small cohort sizes, students benefit from strong relationships with teachers who know them well, understand their aspirations and regularly tailor their learning to match their evolving interests. Our Sixth Form experience is a thoughtful balance of academic rigour, exceptional pastoral care, co-curricular opportunities, leadership development, life skills and wellbeing. Every student is known, supported and challenged by our passionate Sixth Form team. No one fades into the background here. Personalised care is at the heart of everything we do. We place great emphasis on self-awareness, open conversations and confident decision making, especially when it comes to future pathways like work experience, university, or apprenticeships. This approach works: 95% of our students move on to their first-choice destination. You can explore our latest results and university placements , a dynamic hub for academic enrichment beyond A-Level specifications. Super Curriculum activities stretch classroom learning, spark curiosity and encourage deeper subject exploration. Each week, students have a timetabled Super Curriculum period, during which they: Spend 30 minutes engaging with chosen materials Spend 15 minutes reflecting on what they’ve learned Spend 15 minutes sharing insights with peers An additional 30-minute weekly session with form tutors allows students to track progress, exchange ideas and discover new resources. Activities fall under six creative categories: Watch, Listen, Create, Research, Read, Write We understand that every learner is unique. That’s why our admissions process is designed to reflect the individuality of each student. We work closely with families to build a programme that challenges, inspires and supports, whether through carefully chosen subjects, embedded personal support, or confidence-building opportunities. To explore joining our Sixth Form, please contact our Director of Marketing and Admissions at: You can also view our 2024 – 26 Sixth Form options booklet 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 17, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 18, "text": "Meet the Head - Ms C Phelps | More House School More House offers a uniquely tailored education in a close-knit environment, proving that small schools achieve remarkable results. With decades of experience educating girls, we understand their learning styles intimately. We empower pupils from age 9 to 18, fostering their development into accomplished and emotionally mature young women, poised to make a real difference. I am delighted to extend a heartfelt welcome to More House School. This is a truly special place where tradition and innovation converge to create an exceptional educational experience. Our school is a nurturing environment where young minds are ignited and empowered. We believe in the holistic development of each pupil, fostering not only academic excellence but also character, confidence, and a profound sense of purpose. Our commitment to independent education is rooted in the belief that every individual possesses unique talents and aspirations that deserve to be cultivated and celebrated. Within our historic walls, we cultivate a forward-thinking approach to education. The curriculum is designed to inspire curiosity, critical thinking, and a global perspective. Through a balance of academic rigour and co-curricular opportunities, we empower our pupils to become confident, compassionate, and responsible citizens equipped with the tools to navigate the complexities of the modern world with resilience and purpose. Our central London location provides an unparalleled platform for exploration and inspiration. From world-class cultural institutions to the vibrant city life, our pupils are immersed in a stimulating environment that broadens horizons and fuels a lifelong love of learning. I am particularly passionate about fostering a supportive and inclusive community where every pupil feels valued and empowered to reach their full potential. The dedicated staff at More House are committed to creating a nurturing environment where the pupils can thrive academically, socially, and emotionally. I invite you to explore our website and discover the many ways in which More House is shaping the leaders of tomorrow. I look forward to welcoming you to our community. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 19, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 20, "text": "“More House is not only committed to providing academic education to our girls, but also nurturing a moral and social compass for life” The Catholic Faith is an integral part of More House School. We believe that faith is a single step on a great adventure with God and that education helps shape the lives of our pupils and how they As such, school life at More House School aims to educate pupils to live justly in their own lives and to strive for peace and justice for others. We encourage our pupils to think and to act compassionately within the school, the local community, and society. Our goal in Faith in Action is to expand and develop our faith by pursuing the practical aspects of developing a lifestyle dominated by values and concerns that resemble God’s values and concerns. It is a practice in following Catholic Social Teaching, formed from the roots of scripture, following the wisdom of the church and living this out in the world around us. The CST principles of dignity, solidarity, the common good, giving options to the poor, pursuing peace, caring for creation and providing dignity of work and participation form our collective moral compass. More House School reflects this in both our weekly Pupils meet every Wednesday during lunch one to plan and execute their term events, this could be a discussion and talk in school, or a wider school or community project to help those in both our school and wider community. Our More House pupils led on the following initiatives in the Autumn Term of this academic year. It was important for them to settle their Year 7 pupils into the school community through both prayer and social events. Our pupils who are involved in FiA have been integral to all of our liturgies, for both welcome, weekly and advent liturgies."}
{"id": 21, "text": "Our FiA pupils created a focused area within each form allowing for a reflection area to guide prayer and discussion for every pupil. This area both serves as a continual presence of the word of the Lord and a reflective space if needed. During Interfaith week pupil’s led an assembly to educate us on the importance of remembering our differences and the need to share both our faith and worldviews. This culminated in the creation of some key artwork to be displayed all around the school. The following is the winning poster. Pupils and parents raised both money and beautiful gifts for those less fortunate this Christmas. More House School filled 47 boxes and St Andrews Church, Chelsea sent these to those in need around the world through Samaritan’s Purse. Our Sixth Form pupils chose to put on a cinema night for Year 7 and Year 8 pupils. The Year 7 and 8 girls picked their own film and enjoyed a nice fun filled evening led by their Year 12 fellow pupils. The girls wanted to build upon Thomas More’s prayer and have our school values reflected through their own words. Working across key stages we developed a girls school prayer. We believe that our charitable work helps to develop well rounded, caring compassionate young adults, who have the capacity to leave our school with a heightened level of social awareness Our Faith in Action team decided to show off all the wonderful things that they do, and the Catholic Social teaching that they are acting upon. human dignity can be protected and a healthy community can be achieved only if human rights are protected and responsibilities are met . Therefore, every person has a fundamental right to life and a right to those things required for human decency. Josephine Bakhita is the Patron Saint of Human Trafficking. She is a shining ray of hope for human trafficking victims and an inspirational demonstration of how a victim can recover from their trauma and become whole again."}
{"id": 22, "text": "During Fair Trade and Spiritual Week the Religious Studies department took the time to recognise our call to live out Catholic Social Teaching through recognising the need to treat others as we would like to be treated. Through focusing on the need for Fairtrade in the business world, we discussed the knock on effect of our consumerism on local farming and the wider community. We looked at wider spirituality outside of Christianity and took a meditative approach to arts and crafts through mandala making. To finish off this important week we looked at the need for respect during debating all topics of disagreement and recognised the necessity of Ash Wednesday to start off this Lenten period. Faith in Action pupils raised money for the Syrian and Turkish Earthquake appeal through the sale of FairTrade cakes and cookies. This culminates at the end of Fairtrade Fortnight and showcases the passions of our Faith in Action pupils. We raised money by selling £77 worth of raffle tickets to raise money for the Syrian and Turkish Earthquake appeal. Some of our Key Stage 3 Muslim pupils in our penultimate week of Spring term welcomed the start of Ramadan by giving a whole school presentation of the importance and details of Ramadan. We held a non-uniform day and raised an amazing £325. This was in response to the catastrophic flooding in Libya and the emergency Red Cross appeal to support the people affected. Pupils enthusiastically participate in projects, volunteering and charity works that helps others in their local community and further afield 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 23, "text": "Our Caring Community, Knightsbridge Tutors - More House School More House School has an outstanding reputation for its exceptional pastoral care, which is built on a foundation of respect, compassion and dignity in all interactions between staff, pupils and parents. In the pastoral system, pupils are personally supported and guided by staff, in order to become resilient, confident and inspiring young women. , we place enormous value on the Form Tutor relationship with our pupils. There are two Form Tutors per form. This means that each pupil has been assigned one Form Tutor, who is the main point of contact for her and her parents. The Form Tutor maintains an overview of each pupil’s progress, both academic and personal, as well as providing day-to-day pastoral care. With class sizes no larger than sixteen, our Form Tutors’ knowledge of the girls is second to none. Our proactive approach to tackling any issues that may arise creates a safe and warm environment in which pupils flourish. Personal, Social, Health & Economic (PSHE) PSHE is delivered primarily in Form Time every Wednesday and is supplemented by a number of specialist assemblies, themed weeks and guest speakers throughout the year.  Topics covered include: Our PSHE provision is regularly reviewed to ensure it meets the needs of our pupils in an ever-changing world. We are also pleased to offer termly talks for parents on a range of topics. The Senior Teacher Pastoral and PSHE and the Deputy Head Pastoral The Senior Teacher Pastoral and PSHE works closely with Form Tutors to maintain oversight of the day-to-day pastoral work with pupils from Years 7-11, whilst also overseeing the implementation of our PSHE programme. Our Head of maintains pastoral oversight for Years 12 and 13, working closely with Sixth Form Form Tutors. The Deputy Head Pastoral is a member of our Senior Leadership Team and is our Designated Safeguarding Lead (DSL). This means that any safeguarding concerns are reported straight to her. Should the Deputy Head Pastoral be absent or unavailable, then our Deputy DSL is our Associate Head and our Senior Teacher Pastoral and PSHE."}
{"id": 24, "text": "Should any concerns arise, parents are invited to make contact with their daughter’s’ Form Tutor in the first instance, but are most welcome to contact the Senior Teacher Pastoral and PSHE or the Deputy Head Pastoral, should it be necessary. All pupils have access to private, confidential appointments with our School Counsellor. Girls find this support incredibly valuable as they navigate the journey of teenage life. Safeguarding and promoting the welfare of the pupils at our School is our first priority. Our approach is child-centred and all actions are taken in the best interests of the child. Should you ever have a safeguarding concern, please email: Pupils respond thoughtfully and knowledgeably to teachers’ verbal prompts using mature and sophisticated vocabulary. (ISI Inspection Report 2024) There is a thorough assessment and tracking framework in place that monitors how well pupils are faring in their learning. (ISI Inspection Report 2024) What is evident is the real strength of partnerships – with parents, and the wider community and the way in which you engage with them to ensure pupils receive the best. (Diocesan Inspection Report 2019) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 25, "text": "Equity, Diversity and Inclusion (EDI) | More House School At More House School, we celebrate our diversity. In January 2023, we formed our Equity, Diversity and Inclusion Working Group, made up of staff, pupils, parents and governors. Identify and propose equity priorities and objectives that will foster cohesion, eliminate discrimination and ensure everyone feels valued and included. Promote and support inclusive leadership at all levels of the School, in line with our Catholic ethos, and embracing the idea of accompaniment. Conduct biannual surveys to assess the impact of the group’s objectives. Review progress and monitor data biannually in respect of protected characteristics. Determine the impact of initiatives aimed at improving equality and refresh the aims as appropriate. ommunicate equity and diversity practices to staff, pupils and parents. Share good practice outside of More House School. Ensure that succession planning provision is put in place. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 26, "text": "Discover Equity, Diversity & Inclusion (EDI) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 27, "text": "Priscilla left More House in 2014 after doing A-Levels in Maths, Physics and Spanish.  She joined Leeds to... Nadine left More House in 1996 after doing A-Levels in Economics, Maths and History and then read Law at King’s... Raya left More House in 2021 after studying Music, Chemistry and History at A-Level and she then went on to... Emma left More House in 2004 with A-Levels in Chemistry, Biology, Physics and Religious Studies. She studied Biomedical Science at... Alexandra gained A-Levels in French, History, Economics and Classical Civilisation and then went to the University of Warwick between 2002... Jessica joined More House sixth form in 2011 and took A-Levels in Art, Textiles and Music. She describes it as... Kitty left More House in 2012 after doing A-Levels in Geography, History and Classical Civilisation. She had always intended to... Julie left More House in 1991 with four A-Levels in Maths, Chemistry, Biology and French. As she embarked on her... Jessica joined More House in 2004 after she moved with her family to London from Monkstown, Co Dublin. Whilst doing... Ellie left More House in 2011 after doing A-Levels in English, History and Art and was always interested in media... Gabriella left More House in 2007 after studying History, Classical Civilisation and Philosophy & Ethics. She then took a gap... 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 28, "text": "History of More House London - More House School Founded in 1952 by a group of parents seeking better Catholic education for girls in London, More House is a school that celebrates the talents of each unique child, and encourages young women to be agents of change. More House celebrated 50 years since moving into Pont Street. More House celebrated its Golden Jubilee. The school moved into its new home at the beginning of the summer term. The school was threatened with closure due to lack of funds. On Saturday 11th October, a group of pupils staged a protest march to Cardinal Heenan’s home in Westminster to save their school. The Cardinal pledged his support with a guarantee from the church, thus saving the school from closure. The school purchased new premises at 22 Pont Street. More House continued to flourish with a complement of 110 girls, when in 1968, the Canonesses decided reluctantly that they must give up the school in order to concentrate on the university chaplaincy, hostel, and Catholic centre. The current parents formed an Association in order to save the school and took it over under lay management. The first cohort of More House girls reached school-leaving age. Mother Veronica left More House to travel to Uganda where she took over a school for African girls, expanded it and raised it to university entry standard. After Mother Veronica’s departure, Mother St Dominic was appointed Headmistress. More House School now had over 90 pupils, had been inspected by the Ministry of Education and was officially recognised as an efficient Independent Secondary School. More House’s pupil roll had now grown and was recognised as an established school with two classes of girls. The Canonesses took St Thomas More as Patron Saint of the school, embodying Faith and Education. was founded by a group of parents and opened by the canonesses of St Augustine to three pupils, in a hostel they ran for Catholic students on Cromwell Road in South Kensington. Mother Veronica Balfour, the founding Headmistress, was the first nun to gain a degree at Cambridge."}
{"id": 29, "text": "11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 30, "text": "Houses – Participation, Responsibility, Events & Unifying The School Participation of each individual contributing to a greater collective aim is a strong element of the House system at More House. The events are designed to provide an opportunity for students to express themselves no matter what their interests. The events have different levels of competitive ethos so everyone can feel comfortable yet challenged. Daily, all students amass credits and debits which count towards their House total in addition to points for various events. A different House event is run almost weekly throughout the year. The calendar is varied each year to ensure it remains vibrant and appealing. The stalwart events that have been mainstays throughout the House system include Sports Day, House Talent Show, House Entertainment Production, Engineering Challenge, House Netball, Rounders’ Day, House Brains and Countdown and various subject-specific events. Each of these holds a special place in the heart of our students and the level of engagement from the participants and the audience is always fantastic. The organisation around House activities creates opportunities for pupils to take on responsibility. Taking responsibility enhances self-confidence and develops leadership skills. Opportunities include: planning events and/or assemblies; preparing notice boards, motivating others to participate and leading a team to achieve a common goal. Each House is run by a House Captain from the Upper Sixth. They meet weekly as part of a leadership programme that helps them to develop their confidence leading the House assembly and supports them in planning and running the House events. The House system provides opportunities for pupils to work together from different tutor groups and year groups. It provides opportunities for teamwork and opportunities to reflect how individuals contribute to a shared vision. Older students are paired with new students in the House when they first arrive to act as mentors to help ease the transition to secondary school and then to offer advice and guidance on all elements of school life. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 31, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 32, "text": "Academic Life & Learning - More House School More House offers a bespoke education that is future-focussed and prepares young women to be the ethical leaders of tomorrow. Our academic philosophy is underpinned by trust and strong teacher-pupil relationships. We know our students well and support them in succeeding both in and out of the classroom. More House is a greenhouse, not a hothouse. We provide a nurturing environment for all our students to grow to new heights. We value methods of teaching that are rooted in cognitive science and educational research, and prioritise the teaching of core knowledge, which we believe is vital to academic success. We deliberately teach revision and study skills to ensure that core knowledge is secure in the long-term memory and repeat tests and assessments throughout the year to promote ‘over-learning’. We believe that, over time, this fosters confidence and academic pride, whilst providing a secure foundation for the performance of more nuanced skills. Our students are challenged to achieve new heights, whilst being given the personal academic support and guidance they need in order to excel. We believe that every student has a gift. We identify these gifts and provide a personal academic and co-curricular programme to enable every student to reach her full potential. In lessons, our students are challenged to think critically about the world around them and about their work, reflect on their own progress and to map a path of personal growth towards even greater achievement. You can find out more about our Be More programme Responsible and innovative use of technology"}
{"id": 33, "text": "More House is an innovative learning space, where every student uses a personal device to enhance the classroom experience. Teachers are enthusiastic, energetic and creative and have been fully trained in the use of innovative technologies in the classroom and online safety. Lesson materials are shared, submitted and returned through Google Classroom and our students are provided training and support in the responsible use of technology. We have adopted a blended approach to learning that recognises the importance of digital skills, whilst ensuring that creativity, drawing, making, building, handwriting and group work continues to be developed. What I love about More House is that as a pupil you don’t feel pressured to do well, but rather you want to do well in everything you do because you’re made to feel that you have every capability of achieving what you want. More House is a greenhouse, not a hothouse. We provide a nurturing environment for all our students to grow to new heights. Teachers at More House are highly qualified, talented, and committed. We teach responsively, which means that we are constantly engaged in the act of adapting our teaching based on our assessment of students learning in order to maximise their progress. We seek to make explicit what excellence looks like and communicate this clearly to our students. We provide feedback that enables our students to improve, constantly building on their previous skills and knowledge to meet new academic goals. At the same time, they are equipped with the scientific principles of cognitive psychology that underpin learning, and proficient in employing techniques for retaining and recalling knowledge, developing and refining skills, and assessing and evaluating the quality of their learning. High expectations of behaviour for learning"}
{"id": 34, "text": "Visitors to our school comment on the students enthusiasm for learning. They are keen to get the most out of lessons and motivated to achieve their best. Students recognise that learning requires them to inhabit the space between right and wrong, confidence and uncertainty, and to be comfortable there. Our students take their learning seriously, but also know how to have fun in the classroom. They are rewarded for their commitment to high standards of work and diligence and they strive to achieve this. Click on the images below to view the GCSE and Sixth Form Booklets 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 35, "text": "We believe that Art and Design has a central role to play in preparing our pupils for a changing world. Our aim is to provide an Art and Design education of the highest quality, promoting social engagement and a broad view of the world. Pupils are guided in developing a sense of discovery through the making process. Critical thinking and personal reflection are central to pupils developing the skills required to produce meaningful, high-quality artwork. Lessons in observational skills, eye-to-hand coordination, manipulating materials, and colour theory help the girls develop their own style in Art and Design and express themselves. They learn to critically respond to other artworks and deepen their understanding of technique, genre, and the purpose of artistic expression. We devise lessons that allow each pupil’s creative processes to grow organically, supporting them as they flourish into accomplished artists. In Years 7 to 9 pupils will work with a wide variety of techniques including drawing, painting, printmaking, sculpture, textiles, fashion and costume. The starting point for each year is an understanding of the formal elements and principles of Art and Design. Pupils develop the ability to respond to the work of others during gallery and museum trips and are encouraged to express their own opinions and learn how to validate them. Pupils undertake cross-curricular projects, with a focus on creativity and innovation, to give the pupils an opportunity to work in teams to create, develop and market an idea that will be judged by an industry professional. Pupils are encouraged to attend extra-curricular activities including Art club, Textiles club and Photography club. The Art department had a very positive impact on me, increasing my confidence in my abilities and creativity.  I really enjoyed the teaching and being encouraged to try new techniques and mediums. In Years 10 and 11 at GCSE level the pupils can focus on up to three areas of Art and Design, including Fine Art, Graphic Communication, Textile Design, Three-dimensional Design and Photography."}
{"id": 36, "text": "An initial introduction to skills and techniques at the beginning of Year 10 gives the pupils a solid foundation upon which to explore their own ideas. There is scope built into the projects to allow for independent investigations. We believe drawing skills are the foundation of Art and Design practice and projects begin with formal and experimental drawing. This impresses upon the pupils the importance of refining their drawing skills. GCSE Art and Design provides a space where pupils can develop personal ideas and explore creative thinking. Pupils often comment on the freedom and independence of thought afforded them in this subject. Workshop style support sessions are also offered after school. At A level we offer both Textiles, and Art and Design. The courses begin with a review of skills and techniques in the Autumn term of Lower Sixth. Following this, each project begins with a block of observational drawing. They continue to explore creative solutions to their own ideas (with reference to historical and contemporary practitioners), experiment with a range of materials, and produce written work connected to their own chosen area of study. By this stage, they are confident in devising their own projects.They have a plethora of sources to draw inspiration from. Their cultural awareness becomes evident through the connections they make to the work of others. As they find their own visual language and voice, they specialise in the most appropriate materials to communicate their ideas. Weekly Life Drawing and Portfolio sessions are offered to students at A level to support them in preparing for interviews at Foundation or BA Honours level. We have an excellent success rate of students securing places to study on Fashion, Textiles, Architecture, Animation, Film and Fine Art courses UK wide. Since 2008 we have experienced a ‘once in a lifetime’ financial recession and a centennial pandemic. The impact of these supposedly rare events has spread to every corner of our planet and no one in the UK has been left unmarked whether they are aged 2 or 92."}
{"id": 37, "text": "We already faced a climate crisis that threatens our planet, a realignment of our political and economic ties with our near neighbours and the decline of our local high streets. Will London become a donut city? Are these big external events happening more frequently? Are they all intertwined? Can our response to one problem help us solve the others? Never has there been a time when such an alignment of momentous events demanded our attention and understanding. I can’t thank you enough for all the business skills that you taught me over the years that helped me secure my job As citizens, consumers, employees and entrepreneurs we will all be involved with the world of business and the economic and political models that underpin the decision making that will determine our individual wealth and happiness as well as that of our towns, cities and planet. The department is particularly keen to widen the perspective away from traditional models of the economy by introducing and promoting the work of recognised female economists such as Kate Rowe and Mariana Mazzucato as well as Rebecca Henderson (Professor of Management and Strategy, Harvard Business School). We strongly believe that women bring fresh thinking into fields long dominated by white, western men. At More House we are lucky to have a wealth of business activities to explore on our doorstep, from customer service at Peter Jones to workshops on inflation and monetary policy at the Bank of England, as well as theatre trips such as ‘Money the Game Show’ and ‘Kinky Boots’. Parents and old girls are an important resource and our location makes it easy to arrange visits and speakers. Business and Economics B are taught at A Level and the department currently follows the Edexcel syllabus for both. For each the content is slightly less theoretical and mathematical than other boards. Over the two year course students consider aspects of marketing, human resources, finance and operations management from a local to a global perspective. Girls wanting to study pure Economics follow AQA who have introduced new models including Behavioral Economics."}
{"id": 38, "text": "Digital Skills is a core subject for pupils in Years 7-9. The aim is to encourage learners to develop independence and encourage creative thinkers through the world of computerised technology. We teach the girls to use technology responsibly and a significant amount of curriculum time is dedicated to online safety and wellbeing. Each week, students discuss the latest developments published by National Online Safety, which is also widely shared with the parent body. Google Workspace for Education tools are used comprehensively throughout the school. Students follow the Google Applied Digital Skills course in which they learn to use graphic design software to create posters, create their own websites promoting sustainable fashion, analyse film data using Google sheet to predict successful blockbusters, collaborate extensively with other students using shared documents and generate self-marking quizzes to aid their revision. Students complete tasks using CSS and html to create websites which are based on their own inspirations and create videos raising awareness concerning plastic pollution. Each year, pupils in Year 8 compete in GCHQ’s National Cyberfirst Girls competition which tests their ability to solve online cyber challenges, each designed to test their ingenuity to the limit. There is also the opportunity for students to be involved with the robotics club and the coding club which run after school and provide an environment to stimulate students who wish to hone their coding skills further. is an integral and cherished part of school life at More House. From the School Musical, performed on a West End Stage, to the more intimate Lower School Play performed in our stunning 19 century hall, drama is interwoven into the very fabric of the school. Drama lessons at all Key Stages provide a safe and enriching environment in which all students can flourish, academically and socially. The curriculum cultivates links with English, History, Geography, Classics and R.E to provide students with a wealth of material to debate, collaborate and create innovative and unique pieces of theatre."}
{"id": 39, "text": "we build the foundations for success in Drama both academically and socially.  Drama fosters positive communication, teamwork, time management and self-worth and these are the cornerstones to all lessons. Students practically explore a variety of drama styles, authors and practitioners. From the swashbuckling adventures of Homer’s Odysseus to the atmospheric and eerie scenes of Shakespeare’s Macbeth, students are provided with inspirational stimuli to spark their imagination, creativity and friendships. is divided into three components: understanding drama, devising drama and texts in practice.  Understanding drama is a written exam in which students explore the social, historical and political backdrop of Willy Russell’s Blood Brothers and acting techniques required to perform a given role. Students are also tasked with writing an evaluation of the work of live theatre makers. Our location in Knightsbridge enables us to take many enriching trips to the theatre. In the devising unit students are required to create a piece of theatre inspired by a given stimulus and in the style of an influential practitioner. The devising unit is accompanied by a piece of written coursework. In previous years, students have studied practitioners such as DV8, Frantic Assembly and Brecht. Text in practice is a practical component in which students are given two scripted extracts to perform. This year, students studied and performed scripted extracts from Charlotte Keatley’s ‘ Studying drama has made me more creative and enabled me to interpret people and situation in different ways. we offer Drama and Theatre.  This covers Theatre Workshop, Text in Action and Text in Performance. Theatre Workshop is a practical component in which students participate in the creation, development and performance of a piece of theatre based on a reinterpretation of a text. This year, Timberlake Wertenbaker’s ‘ and practitioners, Kneehigh provided the backdrop to a powerful and moving piece on the marginalization of mental health. Text in Action is a practical component in which learners develop and perform a devised and scripted performance. Such performances have included, but are not limited to, Caryl Churchill’s ‘ Text in Performance explores three plays, Mark Haddon’s ‘"}
{"id": 40, "text": "The Curious Incident of the Dog in the Night-Time’ adapted to stage by Simon Stephens, Tennessee Williams’ ‘ . The social, historical and political backdrop of each play is considered in depth as well as the acting and design elements needed to bring the play to life. We encourage all girls to take part in our extracurricular drama group ‘More House Players’.  In fact, some of the images on this page are taken from their recent interactive and immersive theatre performance ‘ written, directed and performed by the fabulous group of girls. Drama at all key stages provides a rich experience for students to broaden their understanding and appreciation of the social, political, historical and cultural fabrics that shape the world we live in. By strengthening such understanding and fostering tolerance, empathy and teamwork, our girls are fast developing the skill set to become the Global citizens of tomorrow. Drama is a fun, creative and expressive subject that interweaves different passions of mine such as Psychology, English, History and Art. I particularly enjoy studying the historical and cultural context of our given plays. at More House share a love of literature and a profound belief in its power to help human beings to understand the world, the past, other people and themselves. We see English language and literature as making a fundamental and intrinsic contribution to a student’s social, personal, and moral development; the growth of language is a means of exploring experience, bringing ideas and feelings into full consciousness, and developing every individual, regardless of age, background, or ability. We are unapologetically literary in our approach; we believe that reading is precious and it lies at the heart of all that we do. We are committed to developing a strong literary culture in our school, in which students are motivated to read critically and communicate in new and innovative ways. As teachers, it is therefore our responsibility to demonstrate creative communication in our teaching practice and we seek to do this at all levels."}
{"id": 41, "text": "Our busy and vibrant department provide many extracurricular outlets for excellence and general interest, including creative writing competitions, reading for pleasure and public speaking and debating. We harness the rich resources we are lucky enough to have on our doorstep; each year group enjoys theatre trips, workshops, lectures and literary tours. We are unapologetically literary in our approach; we believe that reading is precious and it lies at the heart of all that we do we aim to expose students to a wide range of accessible, challenging, and inspiring texts from a variety of genres and periods, and in so doing extend their insight into their personal, social, and moral development and prepare them for future lives in a challenging society. We care about accuracy and aim to ensure that all students can spell and punctuate correctly, know how a sentence works and take pleasure in the subtleties of English syntax. We encourage and foster creative, accurate, and skillful communication skills, both spoken and written, for a variety of purposes and audiences and within a variety of contexts of increasing complexity and demand. pupils are taught in ability groups and prepared for both English Language and English Literature GCSEs. Speaking and Listening is a non-examined, but integral, part of the current GCSE English Language examination. we follow the AQA (Specification B) English Literature syllabus. This course enables students to become confident, reflective and independent readers and writers. They will be able to consider the content of works, themes, styles and techniques and the approaches of different authors, and confidently make considered original comparisons. Success at A Level depends very much on a student’s ability to work independently by reading, researching and writing, and these skills are developed throughout the course. we aim to bring the text being studied to life by visiting as many of our local resources as possible. This includes taking girls to see plays at The Globe, Young Vic, The Duke of York, The National and Regents Park Open Air Theatres. On occasion we have also visited Hyde Park for our creative writing inspiration."}
{"id": 42, "text": "Enrichment at More House is all about creating opportunities for the girls to explore their interests and ideas; develop their cultural and contextual understanding and build their skills in team and project work and as independent learners.  We feel the key to enrichment at More House has to be engaging the girls not just to participate, but to lead and model their leadership to younger years.  We want the girls to bring their curiosity into school – curiosity about their world, their community and their ideas.  Enrichment is a timetabled lesson each week for all girls. the girls enjoy some curriculum time to skill up and explore their world, in a scaffolded environment.  Enrichment at key stage 3 focuses on enabling the girls to look at the world around them and develop greater understanding of areas of personal interest. The girls are supported in learning about how to research, how to identify fake news and fallacy and how to develop their own ideas into realised projects and artefacts. They are taught how to plan and evaluate their ideas. Topics are varied and have included; Animal Abuse; Climate Change; Brexit for Young People; Knife Crime in London; Careers in the Film Industry; Women’s Rights in Saudi Arabia; Education in the UK; Gun Crime in America; Veganism; Horse Riding as a Sport; Gender Equality and The Voting Age in the UK. Enrichment at More House is about giving and becoming More You. It enables you to challenge yourself and find skills and strengths you did not know you had. Pupils visit Art Galleries, Museums, Science Fairs to explore how the world is curated around them.  There is a debating club during the Spring term which is run by the Sixth Form and an Arts and Mandala Club in the Summer Term, run by Year 11 girls. enrichment events include hosting team challenges, hearing visiting speakers, debating opportunities and enrichment days during themed weeks in the spring term."}
{"id": 43, "text": "enrichment is embedded in the LSP (Life Skills Programme) events, as well as from inter-House and inter-Schools Debating Competitions and from involvement in Cultural Projects such as Art Detectives and SPOKE (a national art video competition); lectures at the British Museum; the Science Institute and other academies.  In these years opportunities are presented for the girls to participate and to lead. Recent projects have included researching and presenting, to a Dragon’s Den style pane, the identification of and sponsorship support for a girl’s education in a developing country; researching, creating and styling sustainable fashion items; researching and creating promotional videos for charities and the creation of  quilts for the homeless. Our girls leave with a richly varied experience drawn from being part of a small community, where they can safely explore the edges around their familiar world; where their voices are heard and where they can learn to lead with confidence, assured in their knowledge and skillsets. is an independent research project undertaken by all at More House School. We follow the AQA specification that places focus on project management, the responsible use of resources, developing and realising a planned project and reviewing progress and achievement. The EPQ develops independence, research skills, critical thinking skills and academic writing skills. Students have the opportunity to choose from completing an academic report or an artefact project with an academic report. students in the past have written fully referenced academic reports, developed apps, filmed documentaries and carried out scientific experiments. Topics that have been investigated have included: The impact of climate change on the albatross Ancient Greek morals and modern terrorism The focus is on personalised learning. Students are appointed a supervisor who guides and advises them through the process ensuring that they are best able to reach their potential in their research. The EPQ involves 30 hours of taught skills and 90 hours of independent work and students are given the skills to manage and plan their time. Lessons include debate and discussion about research processes and best practice."}
{"id": 44, "text": "The opportunities for research and project management with EPQ are extensive and The EPQ prepares our students for university and the world of work, whilst entrenching ethical research values, integrity and independence. The EPQ has provided me with additional academic stretch and challenge, as well as allowing me to demonstrate a real interest in a particular subject. opens a world of possibilities at a time when we need a balance between protecting our planet and protecting its people. Geography students become ethical consumers who are focused on sustainability and make a real difference in the world. Geographers understand the science, sociology, politics and economics behind the way the world works. Geography is a big picture subject with endless university and career opportunities. , students are provided with endless opportunities to explore and understand the world around them. In Year 7, students explore the world with maps and understand how climate creates fantastic places. They end the year with a cross-curricular project that looks at the sustainable fashion industry. , students take a deep dive into China, investigate tectonics and explore the UK coastline. Year 9 prepares students for GCSE Geography with a focus on the extremes in cities, African development and climate. With Geography, the world is in your hands. students explore both human and physical environments whilst studying GCSE Geography over two years. The course covers both physical and human geography with a UK-based unit that draws on both areas of study. An investigation of UK landscapes, focusing on coasts and rivers, is the first topic covered, before students explore changing cities and global development in places further afield. In their second year of study, GCSE geographers focus on ecosystems and their management, as well as energy use and resource management. A three-day field trip is undertaken and these skills are also examined."}
{"id": 45, "text": "opens up a whole new world of discovery, analysis and critical thinking. Students study tectonics and how these events are managed around the world. Globalisation is studied in depth with an investigation into the impacts of regeneration on our local school area and the London Docklands. The final year of study sees students exploring the superpowers of global politics and understanding the carbon and water cycles and their effects on our lives. Four days of fieldwork enable students to present a final research project, displaying their independence and deep geographical understanding. The History Department at More House encourages girls to think critically, challenge assumptions and come up with their own interpretations.  We also aim to consistently contextualise their studies by reference to other historical and current events.  Through this approach, our students develop strong analytical and evaluative skills as well as a wider interest in current affairs and wider world events.  These are crucial skills in the modern world, where conceptual understanding, the ability to question assumed facts and logically draw links and reach informed conclusions remains as important as ever. and is a very popular subject.  During these years, the girls broadly follow the National Curriculum, covering topics as diverse as the Roman Empire, the Black Death, the Tudors and the First World War.  Girls develop a contextual understanding of how Britain has developed politically, socially and economically through studying key events, concepts and institutions over time.  This both prepares girls for further historical study at GCSE and A Level, and also provides a valuable understanding of the world in which we live.  Girls are assessed through a variety of ways, from traditional essays and source questions to presentations, debates and even the creation of podcasts."}
{"id": 46, "text": "we cover topics across the past thousand years, and around the world.  In the Tsardom and Communism module, we examine the reasons and ideologies behind the Russian Revolution and the role of the Soviet Union’s first two leaders, Lenin and Stalin, in creating and maintaining a Communist Society.  The strained relationship between the USSR and the USA in the Cold War module, covering case studies from Korea to Cuba is studied in detail.  We also spend time examining British history through the Elizabethan England in depth and we chart the fascinating journey of where power lies in Britain in the Power and the People module, from absolute medieval kings to today’s parliamentary democracy.  The course develops a range of skills, including source work, understanding significance and writing evaluative essays, all of which are vital for success in future study. I am able to comment on historical events and compare them to current events. I am more confident at public speaking .  We cover three main topics; a breadth study on the Tudors; a depth study on Weimar and Nazi Germany (both of which are examined at the end of the course); and girls also complete coursework on the threat of revolution in England between the mid-eighteenth and mid-nineteenth centuries.  Students engage with primary and secondary sources throughout the course, and develop keen analytical and academic skills through considering and utilising historiography.  Independent work and wider reading is essential for this subject and these study skills are developed as part of the course with extra reading material being readily available and encouraged.  Sixth form historians at More House leave as confident, reflective and self-motivated learners with excellent skills for further study and life in the wider world."}
{"id": 47, "text": "These skills and interests are taken beyond the classroom. Many More House historians are involved in the Debating Society, and the department offers a History Reading group which is open to KS4 and 5 students and aims to develop historical understanding for all students involved, and particularly those looking to subject History or related subjects at university.  We also take advantage of our central London location to immerse students in the subjects they are studying by taking trips to local historical sites and museums such as the Globe, Hampton Court and the Imperial War Museum, as well as further afield to the World War One Battlefields and Berlin. Our public examination results are excellent.  Over 60% of GCSE students achieved grades 9 – 7 each year since 2019, and our most recent A Level cohorts (2020 and 2021) have achieved 100% A* – B. History doesn’t repeat itself, but it does rhyme. I am able to quickly understand the disadvantages and advantages of certain policies and describe how they will affect people on a personal level and the wider country, (sometimes more than one country) Mathematical understanding helps us to understand the world in which we live. It underpins, often in an unseen role, many aspects of modern life including credit card security, the spread of pandemics, stock market predictions, computer gaming and decision making in businesses. It facilitates many other subjects: artists learn about perspective, musicians appreciate different rhythms and intervals, economists like to model and predict trends, computer scientists use logic based on mathematical principles, biologists and geographers utilise statistics as well as more obvious links to physics and engineering. At More House School, mathematics is taught in a way to develop students’ confidence in the subject. Developing confidence helps boost motivation which in turn leads to increased attainment and a passion for the subject. As a department we offer extra sessions to extend the maths taught beyond the curriculum as well as sessions to support students where necessary. The department is dedicated to ensure that all students fulfil their potential during their time at More House."}
{"id": 48, "text": "Not only are the lessons incredibly enjoyable and coherent but also all the teachers continually encourage each student and are always there to help if needed , students follow the Maths Progress course which helps to prepare them with the fundamentals required to begin the international GCSE in Year 9. The GCSE is then studied over three years to ensure that each topic can be covered in depth with time spent on reasoning and problem solving, rather than rushing through the course in two years. Many of our students go on to study Mathematics at and some will also study the Further Mathematics course. Our A Level students help run support sessions at lunchtime for younger students and attend online lectures throughout the course to extend their knowledge in areas of interest beyond the specification. Throughout the year groups, the use of technology is embedded into the curriculum with MathsWatch, ActiveLearn, Desmos and Geogebra used daily by the department. 75% of the world’s population does not speak English at all, so in our ever connected globalised community, learning to understand and communicate in another language has become even more important and is now considered a key skill for our modern society. At More House three modern foreign languages are offered; French, German and Spanish.  The curriculum for all three languages is based on the communicative method, where our girls apply grammar more confidently, learn to speak more fluently and know how to listen and read for greater understanding and knowledge of other cultures and ways of life."}
{"id": 49, "text": "In Year 7 all girls learn French as their first foreign language.  Through in-class teaching, speaking activities, online grammar, translation and comprehension tasks, group work and games, it is intended that the confidence in speaking, writing and translating grows along with the accuracy in application of their language.  We cover exciting topics such as: my family, home, holidays and free-time.  At the end of Year 7 our girls have taster sessions in German and Spanish and from Year 8 to the end of Year 9 all girls learn French along with one additional foreign language. From Year 10 when girls start their GCSE subjects we develop the knowledge and skills covered in the lower school.  There is more emphasis on application of grammar to ensure that the speaking, writing and translation skills are the most creative and effective. He who knows no foreign languages knows nothing of his own. We also develop the listening, reading and understanding skills which are required to be successful at GCSE level.  The girls cover a wide range of topics, many of them familiar with lower school topics, ranging from family & friends, my city and holidays to my school, the world of work and global issues. At A-Level our MFL curriculum follows the Edexcel Pearson course and it covers topics pertinent in the countries where the language is spoken both in Europe and the wider world.  We delve into topics that range from artistic and cultural influences, political and societal change and the girls also read foreign language literature and study a film in depth. Our students learn how to communicate at a fluent level in both speaking and writing and develop their skills in research, presentation, translation and summarising in the target language.  Girls learn to read and listen more effectively and respond more readily and spontaneously to a wide range of materials across a wide range of topics, both in-class and online, ready to make them more global citizens for our modern world."}
{"id": 50, "text": "At More House we truly value diversity and recognise what our multinational and bilingual girls bring to our whole school community.  At both GCSE and A-Level we fully support girls in their public examination entries, which they gain in addition to their taught language(s) at school.  The Modern Languages department guides pupils with their native language examination entries, namely: Arabic, Italian, Japanese, Persian, Polish and Russian. To further enhance the MFL curriculum at school, we offer a wide range of trips during the academic year to different language groups.  We have a well-established trip to Montpellier for our French students, along with a long-running trip to Alicante, Spain, aimed at improving oral proficiency and confidence.  For our German students there are opportunities to go to Christmas Markets in the Rheinland and to visit Berlin on a cross-curricular trip with the History department. Over three quarters of the school take part in regular musical activities, both at lunchtime and after school. The department enjoys a high profile, both within the school and the wider community, and presents four significant concerts each year at local venues including Cadogan Hall. The jewel in the department’s crown is the annual Easter choral concert, which every year features major large-scale choral works accompanied by a professional orchestra, and features soloists taken from the student body. More House is the only London day school that takes students on an International music tour every year. Recent trips have included singing in Santa Croce in Florence, St Patrick’s Cathedral in New York and performing at the Beatification Ceremony for Pope Paul VI at St Peter’s Basilica in Vatican City."}
{"id": 51, "text": "The Key Stage 3 curriculum for Years 7 to 9  is designed to be accessible and enjoyable for students of all abilities, from beginner to advanced musicians, while also being excellent preparation for the demands of further study. Students are introduced to the elements of music such as tempo, tonality, and dynamics.  All students learn the importance of reading music notation, through traditional methods as well as via the use of state-of-the-art technology. Our recently installed Mac suite offers our girls professional audio engineering, and composing experience via the use of Logic Pro X, and Sibelius Ultimate. From the outset, our girls gain an early understanding of the fundamentals of composition and have a lot of fun in the process. In addition, our students are introduced to a wide range of musical genres. This plays an integral role in any student’s development and in the music education we offer. Singing is a major part of study at Key Stage 3 and all members of Year 7 and 8 are members of the Junior Choir (which, for Year 7, is a timetabled lesson). We have also recently introduced whole-class instrumental lessons for Year 7. Every girl is given the opportunity to study either the violin, the clarinet, or the ukulele for the year as part of a timetabled academic lesson. This has proved very successful and is a valuable experience for the students. Our students gain a wealth of knowledge that helps them become confident individuals who are interested in the wider world. I love Music GCSE because not only does it bring out the creative side in us but we also learn the meaning and history behind all of it."}
{"id": 52, "text": "During Years 10 and 11 for the GCSE syllabus the academic activities of the department continue to thrive and our results at GCSE in particular are strong. Our aim is to offer Music GCSE to any student that wishes to undertake one of the most rewarding subjects on offer. By the end of Year 9 each student will have gained the breadth of knowledge required to choose Music GCSE.   As well as studying for assessments in performance and composition, the syllabus provides students with the opportunity to study music across the last 400 years of the Western Classical Tradition, studying instrumental music from Bach to Beethoven and vocal music from Purcell to Queen. Students also study musicals, film music and fusions of styles from around the world. Each year, exam students are given the opportunity to present both performance and composition coursework in public at small-scale concerts. Sixth form music students continue to explore music for their A level in more depth and complexity, expanding their understanding and appreciation for all genres. The course offers flexibility and choice very much in the spirit of More House School as a whole, and in addition to study of the Western classical tradition, students can select optional units ranging from 20th Century Art Music and World Music to Jazz, Pop and Musical Theatre. Each year, exam students get the opportunity to present both performance and composition coursework in public at small-scale concerts within the school. We have a number of different choirs that run including Show Choir and Junior and Senior Chamber Choir who recently sang Ola Gjeilo’s ‘"}
{"id": 53, "text": "which can be heard on our school video.  Our Chamber Orchestra has also become one of the school’s most dedicated and accomplished ensembles. The department organises regular trips to make use of the wealth of musical interest in London and further afield. We arrange regular theatre trips in London, and for the past few years have taken Year 9 for a backstage tour, singing workshop and matinee performance of Les Misérables. There is an annual music trip which this year is heading to Tuscany and is incredibly popular with girls. More House School - GCSE & A Level Recitals 2021 The Physical Education department at More House is committed to developing social and physical skills through a rich range of sporting activities, clubs and trips.  Enhanced by the diverse range of exceptional facilities on our doorstop, the students of More House are encouraged to develop a passion for sport. As teachers, we value the stimulating challenge that sport provides for our students, leaving the opportunity to cultivate resilience and bestow a holistic approach to learning. Students will develop physical literacy in the form of functional movements and sport – specific development. Our girls will find themselves in challenging scenarios where they will be expected to be creative, make decisions and reflect on their performance and the performance of others. Each year group has a morning of Games, which is offered at one of our extensive top facilities on offer in the local vicinity.  In addition to timetabled lessons, we offer an array of clubs which take place before, during and after the school day. Our extracurricular programme is run by a dedicated and highly skilled group of staff and external coaches, and is also supplemented by senior pupils. Each year group enjoys a busy fixtures programme played against other local independent schools. The competitive sporting year culminates in an annual Sportswomen’s Dinner to recognise and celebrate the achievement of our athletes."}
{"id": 54, "text": "In Years 7 – 9 the Physical Education curriculum aims to develop and refine the fundamental motor skills and principles of sport. Students will become more confident in demonstrating movement skills within a range of physical activities and will become determined, resilient, competitive independent learners.  Our major sports include netball, athletics and rounders. Alongside these sports students will participate in badminton, tag rugby, football and tennis. In Year 10 and 11 all girls will receive core PE lessons once a week. The curriculum offers a multi-sport experience to engage the girls and foster the desire to live a healthy and active life.  We recognise the significant mental and physical benefits that come with regular opportunities to play sport and learn new skills. Alongside our traditional sports of netball, badminton, athletics and rounders, our curriculum offers students the addition of unconventional sports such as indoor wall climbing and exercise classes such as boxercise and yoga. For those that wish to further their studies of PE, More House offers GCSE PE which has produced a number of rewarding success stories. Students are often able to utilise the sports they engage with outside of school complemented by those complete in PE and extra-curricular clubs. At A Level all our students continue to receive one core PE lesson a week.  There is endless proof that maintaining a positive well – being has an irrefutable impact on productivity and ability to live life to the full. Lessons include the opportunity to visit local fitness centres alongside playing competitively in sports such as netball and rounders. Those taking A Level PE will follow the OCR syllabus, where students have the chance to explore theoretical concepts within a practical setting and will be given a fantastic insight into the amazing world of sports performance."}
{"id": 55, "text": "Politics has recently been introduced as an A-Level option at More House, and has been a popular choice amongst students.  In Politics classes we seek to understand the political world around us, drawing on examples from current events to assess the effectiveness of institutions and the nature of democracy.  Students are encouraged to read widely and engage in current affairs, and they develop strong analytical and evaluative skills, as well as gaining confidence through debates and giving presentations.  Lessons are a safe space for students to discover and voice their own views and opinions, and where they learn to also listen to and appreciate differing views.  Students who have studied Politics at A-Level continue to a range of degrees and professions, including law, teaching, politics and banking. We follow the Edexcel Politics A-Level course.  In the first year students study modules on UK Politics (focusing on democracy and participation, political parties, electoral systems and voting behaviour) and UK Government (focusing on the constitution, Parliament, the Prime Minister and executive and relationships between the branches, including the Supreme Court).  By the end of this part of the course, students have a firm grasp of the workings of both the British political system and of the way that politics interacts with the public. In the second year of the course, students study Global Politics as their comparative module.  This part of the course deals with big concepts such as sovereignty and globalisation, human rights, power and developments, regionalism and the comparative theories of realism and liberalism.  The wide-ranging nature of Global Politics compliments the diverse student body we have, and allows students to explore their understanding of the wider world.  Alongside Global Politics, students study Political Ideologies, including the core ideologies of liberalism, conservatism and socialism.  Our non-core ideology is feminism.  Through covering such a range of concepts and topics, students develop excellent skills and understanding which benefit them in a range of subjects.  It also provides an excellent basis for understanding the complex world in which we live."}
{"id": 56, "text": "Outside the classroom our Politics students are equally active.  They are frequently involved in assemblies, they help run mock-elections at election time and we have trips to key institutions, including Parliament and the Supreme Court. Everything we do in the study of mind, behaviour and human experience is relevant, insightful and eye-opening to the most fascinating study of ourselves. Our true commitment to inspiration and real-life application permeates all our learning endeavours. The Psychology course at More House School is a popular option for A level students. Psychology is made relevant to students studying a variety of subject streams to help them gain an understanding of how the human mind works in different stages of life and situations, and why people react the way they do. These are core skills that are used in all interactions for example in the classroom, in relationships, work, law, business and marketing to name just a few. The broad introductory course covers social, cognitive and biological psychology as well as the formation of our love blueprint and attachments, allowing students to experience a wide range of topics that will help them make informed decisions if they choose to pursue psychology at a tertiary level. Social norms, social groups and their influence on us, perceptions of normality, how our brains interpret our surroundings, and how we change throughout our development, mental disorders and their treatments, memories and thoughts along with the key psychological theories that underpin the studies of these areas. Students who do not wish to continue into tertiary study will still develop excellent skills that will be relevant to all, including independent thinking, critical analysis and research skills. Psychology is life and life is Psychology!"}
{"id": 57, "text": "Our expert teacher is a currently practising psychologist who is able to present relevant and current material in an extremely engaging fashion. We use case studies and enrichment material that have been selected with the current students’ interests in mind. The small classes allow for bespoke feedback in all areas of study. Debates and discussions and skilful mediation by the teacher, expand our students on to deeper thinking and explore the multifaceted subject on many sides. Dynamic and exciting lessons motivate the students to pursue their independent studies outside of the classroom as the study of Psychology gives them a unique opportunity to discover more about themselves. Visits to the the Old Bailey, London’s Central Criminal Court, allow students to apply their knowledge of memory reconstruction and watch how the use of leading and open questions unfolds in court proceedings as well as the opportunity to get a glimpse of what forensic psychology is in action. A very popular area of study in the second year. Students may see themselves as future counsellors, clinical psychologists, business psychologists or forensic psychologists. The More House School Psychology course educates and helps students to prepare for all of these possibilities. The course has been developed with the British Psychological Society to be up to date and relevant."}
{"id": 58, "text": "Our teaching of religious studies is based on the faith and beliefs of the Roman Catholic Church. With Christ at the centre of all that we do, we strive for religiously literate and engaged pupils who have the knowledge, understanding and skills to reflect spiritually, think ethically and theologically and who are aware of the demands of religious commitment in their everyday lives. We seek to affirm the unique value and importance of each pupil, ensure that all pupils have the opportunity to grow in their faith and to provide a coherent and accessible curriculum that challenges the students academically, morally and spiritually. We endeavour to teach by example the Gospel values of Christ and to promote the Catholic faith, while encouraging the pupils to achieve their God-given potential. Ultimately we want to educate the hearts, minds and spirits of pupils and ensure that their lives are illumined in faith.  All pupils at More House will study RS through to GCSE level. In Years 7 – 9 pupils follow the framework from a series called, “The Way, The Truth, and The Life.” This programme is based on the Catechism of the Catholic Church and the Religious Education Curriculum Directory for Catholic Schools published by the Bishops’ Conference. During Years 10 – 11 pupils are prepared for their RS GCSE which is a rigorous course of study, allowing the pupils to develop their knowledge of world religions, critical thinking and evaluation skills and self-understanding.  The exams at the end of Year 11 are in Roman Catholic Christianity and Judaism. It is one of my favourite subjects because of the range of content covered, the wealth of philosophical concepts and the level of critical thought required to evaluate The A level syllabus in Religious Studies provides a broad, coherent and worthwhile course of study. Pupils study three components: Theology (Introduction to Christianity), Philosophy of Religion, and Religious Ethics."}
{"id": 59, "text": "A-level religious studies encourages learners to develop their interest in a rigorous study of religion and belief and relate it to the wider world. Pupils are encouraged to develop an enquiring, critical and reflective approach to the study of religion, including considering the views of scholars/academics, the ability to analyse the nature of connections between the components they have studied, their own values, opinions and attitudes, in the light of their study. Every pupil in the sixth form is required to attend weekly core religious studies. Pupils examine a wide range of philosophical, theological, ethical and moral issues, from euthanasia to medical ethics, faith and science to human dignity and human trafficking. Pupils are able to critically reflect on and understand the meaning and importance of a range of sacred texts and sources of wisdom. Pupils demonstrate knowledge and understanding of the complexity of religious teachings and beliefs and personal choices and commitments. Pupils also critically evaluate religious and non-religious views and are well versed in independent and well-argued accounts of their own and others’ views. Science at More House inspires students to ask questions about the world around them. Our department is passionate about harnessing students’ natural curiosity to develop the deep understanding of Science and Technology that will be vital in their futures. We encourage our students to be creative in the application of their scientific thinking and offer opportunities for independent research for all students from Year 7 to Sixth form. Small class sizes enable us to tailor lessons to students, encouraging their passions and interests and ensuring that every student is supported to fulfil their ambitions. All students at More House School study all three Sciences (Physics, Chemistry and Biology) from Years 7 to 11 when they sit their GCSE exams. After GCSE, many of them progress with one or more of the sciences to attain good grades at AS or A-level with the support and guidance of experienced specialist teachers. To raise new questions, new possibilities, to regard old problems from a new angle, requires creative imagination and marks real advances in science."}
{"id": 60, "text": "Our students are excited by science from the start of their journey with us in Year 7 through to Upper Sixth and beyond. Our A-level scientists are proud ambassadors for their subjects, often strengthen their own love of the subjects through sharing knowledge or supporting junior students through clubs while pursuing an interest with their own holiday projects. In Years 7 and 8 our young scientists explore phenomena that they will have noticed in their everyday lives. How do we use and digest our food? Why is it hard to balance on a beam? How small is the smallest thing? We use scientific methodology and models to investigate these mysteries with experiments in laboratories with scientific equipment. More House School has a proud history of success in the Big Bang Fairs, both regionally and nationally. Students have the option of attending Science Fair Club where they choose an area of study and prepare for the regional Big Bang Science Fairs. Students start preparing for their GCSE exams in Year 9 with an engaging curriculum that aims to bring the abstract theories of science into context. Cross-curricular links are made with Art, Mathematics, Geography, Classics, Robotics and Music to show how the fundamentals of science are core to all areas of our lives. Students have the choice of taking the Combined Science course or three separate sciences at GCSE. More House School offers A-levels in Biology, Psychology, Chemistry and Physics. These are all taught in small university tutorial style classes. Students use the schools’ extensive experimental equipment to support their A level courses and add breadth and colour to take their knowledge gained beyond curriculum the courses. Students are encouraged to work independently and read widely to foster their study skills and prepare them for their future and a love of lifelong learning. We run regular trips for students, taking full advantage of the nearby Scientific Institutes, museums, parks and Universities. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 61, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 62, "text": "Our new Creative Suite, sporting five wall mounted energy efficient screens, adaptable work stations where students often stand instead of sitting, access to robotics, an abundance of Lego and four Cricut machines, is providing opportunities for all departments to explore, discover and create. At More House, this new space marks a step towards the development of a curriculum that acknowledges that the confines of the standard classroom do not serve every child. As educators, we must work hard to provide opportunities for every child to engage creatively and critically with their learning. This adaptable space is not only geared towards the teaching of Digital Skills, but opens up all sorts of possibilities for different departments to do things differently, from weather reports and model making in Geography, to set and lighting design with Lego in Drama and automated solutions in Business Studies. We envisage the More House Creative Suite as a place of wonder – without limits, but filled to the brim with possibility, critical exploration and courageous innovation. Even historically important buildings like ours can offer a taste of the future! 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 63, "text": "We pride ourselves on knowing our students as individuals, our Be More programme is designed with that in mind. We identify students who have the potential to excel both inside and outside of the classroom, to ensure they are motivated and inspired, building their confidence and resilience so that they can achieve new heights. There are two strands to our programme, academic and co-curricular. As part of the academic programme, departments have designed challenging and inspiring curriculums, encouraging debate, perseverance and academic excellence. Our co-curricular programme ensures students can increase the breadth and depth of their knowledge and understanding through a vast array of clubs and activities as diverse as Introduction to Italian Club led by students, and STEM Club. We have a range of guest speakers across the year who specialise in industries such as Medicine, Law, Politics and Engineering. Students participate in regular trips to universities and cultural institutions to inspire them and encourage a sense of purpose. It was an intimidating experience, but definitely worth it. I faced my fears of speaking in public. I left feeling accomplished, brave, and powerful! Our Be More programme is inclusive, with students invited to join the programme on recommendation from staff or peers at any point in their More House journey. These students are offered mentoring and advice on both strands of our programme. Most of the clubs and activities are open to all students, to ensure that everyone at More House benefits from the opportunities available. At Key Stage 3 and Key Stage 4 our more able students are offered academic mentoring from the Sixth Form and staff, where they can discuss their academic progress, how they are participating in school life, wider reading and a tailored programme of clubs and activities are recommended to them."}
{"id": 64, "text": "In our Sixth Form, staff work with our more able students to tailor our academic programme and ensure students are extending themselves within and outside of the classroom. Speakers and journal clubs are hosted by departments, trips and workshops run regularly and students are guided to attend the fantastic events hosted by London universities and learned societies. Events such as the Be More Brunch are held regularly and focus on fostering vital skills such as critical thinking and reasoning, whilst developing confidence and a sense of community. More Talks is a new initiative where students will research, develop and present TEDx style talks on a variety of topics. The initiative allows students to practise the art of storytelling whilst delivering talks about their passions. Applicants to Oxbridge and other leading universities are given guidance and assistance as they make their choices and complete their applications, and any who are invited to interview will be given mock interviews both internally and with contacts outside school. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 65, "text": "Learning Support Teachers London - More House School At More House School, we cherish the whole person and are not bound by traditional measures of success. Our pupils know that they are so much more than the grades they achieve as students. In order to reach their potential, their happiness and self-confidence as learners is paramount, so we adopt a whole school approach to learning support. Our teachers are aware of the different needs of pupils and able to differentiate lessons more effectively due to small class sizes. We focus on the individual and offer a bespoke education to all. We pay equal attention to cognitive and emotional factors and offer an each pupil to achieve their very best and to become as We are also able to draw upon the services of a range of external practitioners, where required. This may include, for example, educational psychologists, clinical psychologists, psychiatrists, art therapists, music therapists and psychotherapists. Support is provided in a variety of formats depending on the unique needs of each pupil. The intensity and duration of support is based on the pupil’s specific needs.  Support can include one-to-one or group sessions focusing on, for example: Support is reviewed regularly and always in liaison with subject teachers to ensure that the needs of pupils are met. SEND staff also observe lessons throughout the year providing supportive feedback to staff on aspects of their practice. This also provides a key means of assessing how pupils are managing in class, enabling us to develop a more nuanced and rounded understanding.  Support is always viewed as a collaborative endeavour between SEND staff, pupils, teachers and home. SEND staff are qualified to conduct assessments for examination access arrangements. We have access to a range of psychometric tests, which can be used for more detailed assessments. We can also arrange external assessments where needed. We can support pupils regardless of whether a formal diagnosis of a special educational need or disability is present. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 66, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 67, "text": "Results and Destinations | More House School Congratulations to all our girls on their excellent A-Level and GCSE results this year. At More House, we celebrate academic achievement, but know that this is not what defines our pupils. We value the whole person and our girls achieve so much more in their time with us than a set of grades. These results represent success in so many ways, as each learner’s journey is unique. As you know crude statistics do not do justice to the value-added scores and individual successes and achievements of every one of our girls. Our value-added results continue to underline how, relative to their academic starting points, More House girls outperform other schools with similar intakes in public examinations. In terms of Value Added, we can confidently say that we have added at least one grade to pupils’ outcomes, on average, across all subjects. The bespoke offering in our Sixth Form means that we encourage the girls to know themselves well and to choose the right path when they leave us. View university and apprenticeship destinations for 2020-2024 here 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 68, "text": "Co-curricular Sport and Physical Education forms an important and essential part of the well-balanced education offered to all More House pupils. It provides the opportunities for students to broaden their horizons and look beyond the classroom. Every girl in the school is afforded a rich programme of team activities, clubs and trips to select from, which are on offer before, during and after the school day. The programme is run by a dedicated and highly skilled group of staff and external coaches, a number of whom have played sport at high level or more importantly achieved significant success as a coach in the development of individuals. These activities allow girls to extend their learning outside of lessons, to enjoy a new hobby, try a different sport or pursue their own healthy, active lifestyles. Netball, hockey, football, rounders, rowing and athletics all feature within the competitive clubs schedule. Each year group enjoys a busy programme of fixtures of fixtures played against other local independent schools. Sport at More House is rigorously structured but sympathetically balanced, offering a broad range of activities but maintaining its core belief that sport should be about participation and enjoyment. If competitive, team sports are not your thing then a host of excellent clubs such as dance, fencing, running, tennis and badminton provide activities for all to excel and enjoy. More House girls are also encouraged to attend sporting trips throughout the school year. The sporting trips on offer range from watching the local Superleague netball team to venturing further afield for the annual ski trip. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 69, "text": "Co-curricular Programme | More House School Our Co-Curricular Programme looks to build self-confidence and resilience in our pupils by encouraging them to explore areas of interest beyond the classroom. The variety of activities on offer allows students to challenge and develop existing talents and offers the opportunity to discover new ones. The Earth and Planetary club is a superb example of how the programme supports and challenges students’ thinking through topical discussion and raising awareness of global issues. We understand that all our students deserve a broad and enriching school experience, whilst making the most of our central London location. For those with a passion for sports, drama and music we offer an inclusive range of activities. Whether your child wants to progress through the grades in piano, take on a new challenge and learn to indoor climb or play a role in the school production, our programme supports students to develop transferable skills that will support them beyond their time at More House. Above all our Co-curricular Programme offers a balance. The activities are underpinned by the Catholic values and offer students an opportunity to engage in the wider school life and develop a sense of belonging to the school community. In Key Stage 3, clubs such as Book club and Mandala, Art and Textiles club immerse our students in opportunity, allowing them to be creative whilst Fencing, Dance and Netball clubs will keep the girls active throughout the week. The Co-curricular Programme supports an extensive array of music clubs offering every student in Year 7 to learn an instrument. Year 10 and 11 have a first-class balance of academic, cultural and sports co-curricular activities. Our students take pleasure in learning new skills such as calligraphy at Handwriting club or Origami at Japanese culture and language club. In addition many of our girls maintain their fitness and nourish their well-being whilst taking in the beautiful views at our rowing club based at Fulham Reach."}
{"id": 70, "text": "Our Sixth Form programme supports the students’ preparation for life after More House with clubs focused on building independence. Clubs like driving test theory and preparation for University encourages our students to prepare themselves in taking the next step. for our Clubs and Activities Programme for the Autumn Term. My daughter blossomed at More House, growing into a confident and assured young lady more than ready to take her next steps into the world. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 71, "text": "Being in central London, More House is perfectly positioned to use all that the city has to offer as an extension of our school buildings. Our science labs are the London parks, the world-class museums are our exhibition halls and London’s modes of public transport are our school corridors. We make the best of all that London has to offer and we claim these special places as our own, providing as many opportunities as possible for our pupils to enjoy them, learn from them and think bigger than the four walls of their classrooms. In Key Stage 3, pupils are taken off timetable once a half-term for a City Curriculum Day. These days are cross-curricular in nature and give our students the chance to explore what they are learning in lessons and to bring the outside world into their understanding of all they are discovering in school. More House ensures that the girls leave them with whatever they need to head to their next stage of life. They offer flexibility and creative solutions to allow for the individual needs of pupils. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 72, "text": "Find out more about our partnerships by clicking on the links below. Partnerships benefit all involved, broadening our horizons and enabling new relationships to develop (Celebrating Partnerships (ISC)) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 73, "text": "Your Admissions Journey | More House School Upon Registration, your daughter will be invited to attend a Taster Day at More House, where she will meet with our Head and/or Deputy Head for an informal interview and complete two assessments in Maths and English. Applications can be made throughout the year, with pupils able to start at the beginning of the Autumn, Spring or Summer Term. To enquire about a place, please contact our admissions team via the email address More House School is part of the London 11+ Consortium which is an association of 14 independent London day schools for girls which operates one exam across the group. The Consortium was set up to provide an application process which is fair, clear, robust and accessible to children from all schools and backgrounds. The assessment process goes beyond testing cognitive ability alone and seeks to discover a child’s potential in creative and critical thinking, analysis, synthesis and problem-solving. For further information about the assessment process please visit the website. This will give you further information on the Consortium itself, – Friday 28 November 2025 or Tuesday 2 December 2025 Once you have completed the Registration Form you will be sent an entrance test form to find out which other schools your daughter is applying to and where she would like to sit the exam.  You will also need to send us any Educational Psychologists reports by the closing date for registrations. At More House, we look beyond exam results and place as much emphasis on your daughter’s interview and reference from her current school. After this, your daughter will be invited to a selection morning or afternoon at More House."}
{"id": 74, "text": "As every learner is unique, we offer a bespoke program for each student, rather than a ‘one size fits all’ admissions policy. We work with each family to ensure that students find the right balance of subjects to push them to achieve their potential and expand their reach for life beyond school. Whilst doing this we also work to nourish the confidence of each pupil, and provide personalised support embedded into her timetable to ensure she can achieve her learning goals. We anticipate meeting with you in the near future. Should you require further information regarding More House or wish to discuss our Admissions process, please do not hesitate to contact us. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 75, "text": "If you are interested in a place at More House for your daughter, please complete the below enquiry form and our admissions team will be in touch. Alternatively, please feel to contact us on Saint Helena, Ascension and Tristan da Cunha South Georgia and the South Sandwich Islands The information that you provide within this form will be used to help us guide you through the process of visiting and registering your daughter at More House. Please click below to indicate that you have read and understood our Privacy Notice and that you are responsible for the accuracy of the information supplied. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 76, "text": "International Applications and Visas | More House School More House School is able to provide a limited number of Child Student Visas (or Tier 4 visas as they were previously known).  If your child requires a visa to study in the UK please be sure to inform our as soon as possible when you register your daughter with us. More House uses an external firm of immigration lawyers, Newland Chase Education, which is a leading global immigration and visa provider with specialist expertise in the needs of educational institutions and students and we do not assess the visa applications ourselves.  The cost of the immigration lawyer is not covered by the school and the cost of this is around £695. Newland Chase will deal with your visa application and once they are happy that the visa application is compliant and paperwork is complete, they will advise us to issue a CAS (Certificate of Acceptance of Studies).  This is used with your visa application to obtain your Child Student Visa. . Please note that the School will only accept applications that are processed through this company. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 77, "text": "Scholarships and Bursaries | More House School At More House we aim to reward and encourage excellence.  We offer Academic, Sport, Art & Design, Drama and Music scholarships and these are normally awarded at the main entry points to the school, namely Year 7 and Lower Sixth. For Year 7 entry we offer academic scholarships in addition to Music, Sport, Drama and Art & Design scholarships.  Please see our . There will be additional interviews and assessments for scholarships in January 2026. Applications can be made for scholarships at any time before or up to the closing date for registrations which is 7 November this year. Applicants applying for a scholarship will be sent an additional application form to complete. When submitting this application form please ensure this is accompanied by a letter of recommendation from the most appropriate teacher at her current school. If your daughter is applying for Sixth Form and would like to apply for scholarship please discuss this directly with our A limited number of bursaries are offered to pupils joining the school in Year 7 and thus will be in place before the academic year starts. Special governors’ bursaries may be awarded at any point in the academic year and will normally be in response to a particular set of circumstances, as well as having special provisions attached. Hardship bursaries are usually awarded only to girls already in the school and in examination years. Parents who wish to apply for bursaries should contact our who will send you the Bursary Award Policy and Procedures.  The closing date for submission of all completed bursary applications, including financial disclosure of parental income and assets, needs to be completed by 7 Please note that bursaries do not include the Registration Fee, the Bursary Application fee, the Acceptance Deposit or any extras except for those stipulated if an award is made. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 78, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 79, "text": "Following the decision by the Government to charge VAT on fees, the below cost per term is inclusive of VAT and will apply from January 2025. Years 7 - 13 : £10,530 (per term) * inc VAT More House fees are subject to annual review but every effort is made to keep the costs to a minimum. There is a £150.00 registration fee for each application and you will be required to pay a deposit (50% of one term’s fees) on acceptance of your daughter’s place.  The deposit will be refunded at the end of your daughter’s time at More House. The deposit is non-refundable if your child does not take up the place offered. Private Music lessons are available for singing, all string, woodwind and brass instruments, guitar and drums and are each £295.00 per term, payable to the individual Music Teacher (10 individual 30 minute lessons). There will be some trips available to pupils that incur an extra cost. Some of these are optional (e.g., Evening Theatre Trips) others are part of the academic curriculum (e.g. Activities Week). Fees are due contractually by the first day of each term A full term’s notice of withdrawal (given no later than the first day of the previous term) is required in writing to the Head or a term’s fees are payable in lieu of the correct notice An allowance of up to 15% off the fees is given in respect of the eldest daughter when there are three (or more) sisters attending the School at the same time Fees can be paid via direct debit and a form is available . Please complete and email the form to our Bursar when completed. The school maintains a Pupils’ Personal Accident Insurance Policy to give cover in the event of specified serious injuries occurring. The cover is operative whenever the pupil is engaged in any activity, arranged at or through the School, within the UK. Details of cover and benefits are shown in the attached brochure. Personal Accident Insurance Scheme for Students"}
{"id": 80, "text": "Pupils’ possessions, effects and baggage are not insured by the Governors against loss or damage, either on school property, elsewhere or in transit to and from school.  Parents are strongly advised to obtain such insurance which can usually be done through an extension on their own Home insurance policies, if not included automatically. Annual insurance is arranged by the School in respect of trips and visits in the UK and abroad – details are available from the Bursar. No reduction of fees is made by the School for absence through illness. Optional fee refund protection is available at a termly rate of £1.25% based on the termly fee.  Your participation amends your parent contract by entitling you to a refund of fees – please complete and return this to the School as soon as possible if you wish to take advantage of this arrangement. Alternatively print off the document, complete the fields in BLOCK capitals, scan, and return to the school by e-mail. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 81, "text": "At More House School we are committed to creating a safe and nurturing environment for all our students, where they can learn and thrive without any worries or concerns about their well-being. The safety and welfare of our students are of paramount importance to us, and we hope that this web page serves as a valuable resource to ensure that everyone in our School community is well-informed about our safeguarding practices. At More House School, we believe that every student deserves to learn in an environment where they feel secure and supported. Safeguarding encompasses various aspects of our students’ lives, including physical and emotional well-being, their personal development, and their ability to learn effectively. We are dedicated to uphold the highest standards of safeguarding and promote a culture of vigilance, awareness, and care within our School community. Click on the links below for further information Reporting safeguarding concerns and resources 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 82, "text": "All school uniform (with the exception of our choir dress) can be obtained from the Perry Uniform We are currently in the process of getting a new choir dress. Parents will be notified and a link will be added here soon. Please contact our Parents’ Association if you would like to enquire about second-hand uniform which is dealt with by them. If you are a current or past parent and would like to donate some second-hand uniform please contact our Parents’ Association. All items below marked with an asterisk must be obtained from Perry Uniform or from our second-hand uniform shop. Navy blue v-neck jumper – regulation pattern * Long-sleeve or short-sleeve gingham blouse – regulation pattern * Navy blue regulation skirt * or navy blue trousers * Sensible shoes in black – leather and flat (no boots, heels or trainers) Outdoor navy coat regulation pattern * or the pupil’s own choice of plain navy or black coat Athletic trainers (Converse, Vans, and other canvas fashion shoes are not acceptable) Shin pads & a gum shield are required for hockey All Key Stage 3 take part in choir. A link to the new choir dress will be sent out to parents later in the summer and updated here. House t-shirt in your allocated house colour (please ensure you know which house your daughter is in before purchase) *  Canterbury - Green, Iona - Blue, Santiago - Yellow, Walsingham - Red. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 83, "text": "If you are interested in hiring rooms in our school, please to book through School Hire. More House School benefits from state-of-the-art facilities including classrooms, dance studio and main hall. Below is a list of companies currently hiring rooms in More House School. We have a diverse portfolio of clubs and activities running every evening and during the weekend. If you would like any further information about these companies, click the link below to their website: 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 84, "text": "Each day, the girls at More House eat lunch together in the Dining Room, along with members of staff. Connect Catering are responsible for lunch, which is prepared and cooked on our premises. More House is renowned for its diverse and inventive menus, delicious vegetarian options, tasty salad bar and fresh desserts. There is also a tuck shop available to pupils at break time. To download the menu for the Summer Term, please More House is a fantastic school because it is very inclusive and they have the best potato wedges you’ll ever eat. I love the variety of food there is to offer. I especially love when we have themed lunches! 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 85, "text": "Our Staff and Governors | More House School Clerk to the Governors is Ms V Johnson, Director of Finance and Resources Deputy Head, Head of Mathematics and Digital Skills Coordinator Head of Operations, Designated Safeguarding Lead and Music Teacher Mathematics and PSHE Teacher and Even More Curriculum Coordinator Director of Music, Director of Co-Curricular Head of Modern Foreign Languages and Spanish Teacher History, Politics and Religious Studies Teacher and EPQ, Careers Coordinator Head of English, ECT and New Staff Coordinator Head of Art and Textiles and PSHE Teacher English Teacher, Even More Curriculum Coordinator and Resource Centre Manager Science Teacher, Duke of Edinburgh Award Coordinator Head of Sixth Form, Head of History and Politics Music and Physics Teacher, Examinations Officer and Assessment and Data Lead Head of PSHE and RSE, Drama Teacher and LAMDA Coordinator Pastoral Support Officer and Deputy Designated Safeguarding Lead 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 86, "text": "Our policies are available to read and download. Please email if you would like to receive a hard copy. Relationships and Sex Education (RSE) Policy Special Educational Needs and Disability (SEND) Policy Sexual Violence and Sexual Harassment Policy Visitors and Visiting Speakers Policy and Procedure 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 87, "text": "More House is inspected by both the Independent Schools Inspectorate (ISI) and the Westminster Diocese. We are proud to share our most recent inspection reports and Good Schools Guide review below. Teachers create a supportive and positive environment in lessons where praise and encouragement along with different types of questioning move the pupils forward in their learning. Leaders plan to meet every pupil’s needs so that they attain their academic and personal potential and leave the school as people of purpose. To that end, they maintain a warm and inclusive atmosphere where every individual is valued. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 88, "text": "11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 89, "text": "Pastoral Newsletter - Spring Term 2 2025 (1) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 90, "text": "Duke of Edinburgh Parent Information Evening (6.00pm) Online Pre-Exam Mass in School fro Year 11 & Year 13 (8.30am) All welcome Duke of Edinburgh Bronze Practice Expedition Parent Activities Week Information Evening (6.00pm) Parent Coffee Morning (9.00am) All welcome Year 5 - 10 & 12 Mass in School (8.25am) All welcome Year 5 - 10 & 12 Mass in School (8.25am) All welcome Parent Coffee Morning (9.00am) All welcome Year 10 & 12 Parents' Evening (4.15pm) In person Patronal Mass at St Mary's Church (9.30am) All welcome Duke of Edinburgh Bronze Award Qualifying Year 11 Transition Day incl. Book Return & Strawberries & Cream Summer Concert at Holy Trinity Church (6.30pm) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 91, "text": "Click the event below to get your tickets. On Wednesday 13th December, our Music department orchestrated a truly delightful Nine Lessons and Carols. Themed around Advent, the readings... It was lovely to see some old faces back for our Alumni celebration event  on Tuesday evening which began at... On Thursday 9th November we celebrated the achievements of pupils past and present for their hard work in 2022-2023 with our... On Thursday we ended the Summer Term and the school year in true More House tradition... with of course House... We were thrilled to share the remarkable accomplishments of our students at the Summer Concert held in Holy Trinity Church.... On the evening of Thursday 8th June we hosted the annual Art, Design and Textiles Exhibition. It was brilliant to... On the evening of March 28th, 2023, Holy Trinity Church was filled with anticipation as music lovers gathered to witness... On Thursday 23rd March, Key Stage 3 (Year 7 and Year 9) put on an amazing production of Antigone. The... 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 92, "text": "Mr Ian Bogle (clerk@morehousemail.org.uk) 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 93, "text": "IMPORTANT! YOUR ACCESS TO THIS WEBSITE IS SUBJECT TO LEGALLY BINDING TERMS AND CONDITIONS. CAREFULLY READ ALL OF THE FOLLOWING TERMS AND CONDITIONS. ACCESSING THIS WEBSITE IS THE EQUIVALENT OF YOUR SIGNATURE AND INDICATES YOUR ACCEPTANCE OF THESE TERMS AND CONDITIONS AND THAT YOU INTEND TO BE LEGALLY BOUND BY THEM. IF YOU DO NOT AGREE WITH THESE TERMS AND CONDITIONS, PLEASE LEAVE THE SITE IMMEDIATELY.¨ This is an agreement between you (“You”) and More House School (the “School”). “We” and “Us” means both You and the School. The effective date of this Agreement is when You accept this Agreement in accordance with the procedure set out above. You hereby consent to the exchange of information and documents between Us electronically over the Internet or by e-mail, and that this electronic Agreement shall be the equivalent of a written paper agreement between Us. You acknowledge that any and all information, content, reports, data, databases, graphics, interfaces, web pages, text, files, software, product names, School names, trade-marks, logos and trade names contained on this web site (collectively the “Content”) including the manner in which the Content is presented or appears and all information relating thereto, are the property of their respective owners as indicated, the School or its licensors, as the case may be. The School hereby grants to You a personal, non-transferable and non-exclusive license to access, read and download one copy of the Content. (i) distribute the Content for any purpose including without limitation compiling an internal database, redistributing or reproduction of the Content by the press or media or through any commercial network, cable or satellite system; or"}
{"id": 94, "text": "(ii) create derivative works of, reverse engineer, decompile, disassemble, adapt, translate, transmit, arrange, modify, copy, bundle, sell, sub-license, export, merge, transfer, adapt, loan, rent, lease, assign, share, outsource, host, publish, make available to any person or otherwise use, either directly or indirectly, the Content in whole or in part, in any form or by any means whatsoever, be they physical, electronic or otherwise. You shall not permit, allow or do anything that would infringe or otherwise prejudice the proprietary rights of the School or its licensors or allow any third-party to access the Content. The restrictions set out in this Agreement shall not apply to the limited extent the restrictions are prohibited by applicable law. With the exception of personal information, You hereby grant to the School the perpetual, unlimited, royalty-free, worldwide, nonexclusive, irrevocable, transferable license to run, display, copy, reproduce, publish, bundle, distribute, market, create derivative works of, adapt, translate, transmit, arrange, modify, sub-license, export, merge, transfer, loan, rent, lease, assign, share, outsource, host, make available to any person or otherwise use, any information or other content You provide on or through this web site or which is sent to the School by e-mail or other correspondence, including without limitation, any ideas, concepts, inventions, know-how, techniques or any intellectual property contained therein, for any purpose whatsoever. The School shall not be subject to any obligations of confidentiality regarding any such information unless specifically agreed by the School in writing or required by law. You represent and warrant that you have the right to grant the license set out above. The School may from time to time, but is not obligated to, monitor your use of the web site and collect, store and use personal information about You for providing service you may of requested and You hereby consent to such collection, storage, use and disclosure and waive any right of privacy You may have. YOU MAY ACCESS, CORRECT AND DELETE YOUR OWN PERSONAL INFORMATION STORED BY School BY CONTACTING US IN WRITING. 6. LIMITATIONS ON LIABILITY AND DISCLAIMERS"}
{"id": 95, "text": "THERE IS NO GUARANTEE THAT PERSONAL INFORMATION AND TRANSACTIONS ON THIS WEB SITE OR ON THE INTERNET WILL BE MAINTAINED CONFIDENTIAL AND SECURE. THE USE OF THIS WEB SITE AND THE CONTENT IS AT YOUR OWN RISK AND THE School ASSUMES NO LIABILITY OR RESPONSIBILITY PERTAINING TO THE CONTENT, YOUR USE OF THE WEB SITE OR THE RECEIPT, STORAGE, TRANSMISSION OR OTHER USE OF YOUR PERSONAL INFORMATION. This web site and its Content are not to be construed as a form of promotion. This web site may contain links to other sites. The School does not assume responsibility for the accuracy or appropriateness of the information, data, opinions, advice, or statements contained at such sites, and when You access such sites, You are doing so at Your own risk. In providing links to the other sites, the School is in no way acting as a publisher or disseminator of the material contained on those other sites and does not seek to monitor or control such sites. A link to another site should not be construed to mean that the School is affiliated or associated with same. THE School DOES NOT RECOMMEND OR ENDORSE ANY OF THE CONTENT, INCLUDING WITHOUT LIMITATION ANY HYPER-LINKS TO OR CONTENT FOUND, ON OTHER WEB SITES. The mention of another party or its product or service on this web site should not be construed as an endorsement of that party or its product or service. The School will not be responsible for any damages You or any third-party may suffer as a result of the transmission, storage or receipt of confidential or proprietary information that You make or that You expressly or implicitly authorize the School to make, or for any errors or any changes made to any transmitted, stored or received information. You are solely responsible for the retrieval and use of the Content. You should apply Your own judgment in making any use of any Content, including, without limitation, the use of the information as the basis for any conclusions."}
{"id": 96, "text": "THE CONTENT MAY NOT BE ACCURATE, UP TO DATE, COMPLETE OR UNTAMPERED, AND IS NOT TO BE RELIED UPON. THE CONTENT IS PROVIDED FOR EDUCATIONAL AND INFORMATIONAL PURPOSES ONLY AND SHOULD NOT BE INTERPRETED AS A RECOMMENDATION FOR ANY SPECIFIC PRODUCT OR SERVICE, USE OR COURSE OF ACTION. THE CONTENT ON THIS WEB SITE IS NOT INTENDED TO BE USED AS A SUBSTITUTE OF ANY KIND FOR PROFESSIONAL ADVICE. IT IS YOUR DUTY TO OBTAIN PROFESSIONAL ADVICE FROM A QUALIFIED PROFESSIONAL ADVISOR TO MEET YOUR NEEDS. YOU SHOULD NOT ACT OR RELY ON ANY OF THE CONTENT WITHOUT SEEKING ADVICE OF A QUALIFIED PROFESSIONAL. EXCEPT AS EXPRESSLY PROVIDED IN THIS AGREEMENT, THIS WEB SITE AND ALL CONTENT, PRODUCTS, SERVICES AND SOFTWARE ON THIS WEB SITE OR MADE AVAILABLE THROUGH THIS WEB SITE ARE PROVIDED “AS IS” WITHOUT ANY REPRESENTATIONS, WARRANTIES, GUARANTEES OR CONDITIONS, OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO, WARRANTIES AS TO UNINTERRUPTED OR ERROR FREE OPERATION, AVAILABILITY, ACCURACY, COMPLETENESS, CURRENTNESS, RELIABILITY, TIMELINESS, LEGALITY, SUITABILITY, PRIVACY, SECURITY, MERCHANTABILITY, QUALITY, TITLE, NON-INFRINGEMENT OR FITNESS FOR A PARTICULAR PURPOSE, OR THOSE ARISING OUT OF A COURSE OF DEALING OR USAGE OF TRADE.IN NO EVENT WILL THE School, ITS AFFILIATES, AGENTS, LICENSORS, SUPPLIERS, OR THEIR RESPECTIVE DIRECTORS OR EMPLOYEES BE LIABLE FOR ANY SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, AGGRAVATED, ECONOMIC OR CONSEQUENTIAL DAMAGES, HOWSOEVER CAUSED, INCLUDING BUT NOT LIMITED TO: DAMAGES FOR LOSS OF USE, LOST PROFITS OR LOST SAVINGS, EVEN IF THE School OR ANY OF ITS LAWFUL AGENTS OR EMPLOYEES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR CLAIM. IN NO EVENT WILL School, ITS AFFILIATES, AGENTS, LICENSORS, SUPPLIERS, OR THEIR RESPECTIVE DIRECTORS OR EMPLOYEES, BE LIABLE FOR DAMAGES OR LOSSES RESULTING FROM: VIRUSES, DATA CORRUPTION, FAILED MESSAGES, TRANSMISSION ERRORS OR PROBLEMS; TELECOMMUNICATIONS SERVICE PROVIDERS; LINKS TO THIRD-PARTY WEB SITES; THE INTERNET BACKBONE; PERSONAL INJURY; THIRD-PARTY CONTENT, PRODUCTS OR SERVICES; DAMAGES OR LOSSES CAUSED BY YOU, OR YOUR RESPECTIVE EMPLOYEES, AGENTS OR SUBCONTRACTORS; LOSS OF USE OR LACK OF AVAILABILITY OF FACILITIES INCLUDING COMPUTER RESOURCES, ROUTERS AND STORED DATA; THE USE OR INABILITY TO USE THIS WEB SITE OR THE CONTENT; ANY OTHER WEB SITE ACCESSED TO OR FROM THIS WEB SITE; OR EVENTS BEYOND THE REASONABLE CONTROL OF THE School, EVEN IF THE School OR ANY OF ITS LAWFUL AGENTS, OR EMPLOYEES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR CLAIM. IN NO CASE WILL THE SCHOOL’S, ITS AFFILIATES’, AGENTS’, LICENSORS’, SUPPLIERS’, AND THEIR RESPECTIVE DIRECTORS’ AND EMPLOYEES’ CUMULATIVE TOTAL LIABILITY ARISING UNDER ANY CAUSE WHATSOEVER (INCLUDING WITHOUT LIMITATION BREACH OF CONTRACT, TORT, NEGLIGENCE, GROSS NEGLIGENCE, OR OTHERWISE) BE FOR MORE THAN THE AMOUNT, IF ANY, PAID BY YOU UNDER THIS AGREEMENT TO ACCESS THIS WEB SITE, IN THE YEAR IN WHICH THE CLAIM AROSE."}
{"id": 97, "text": "THE School ASSUMES NO OBLIGATION TO UPDATE THE CONTENT ON THIS SITE. THE CONTENT ON THIS SITE MAY BE CHANGED WITHOUT NOTICE TO YOU. THE School IS NOT RESPONSIBLE FOR ANY CONTENT OR INFORMATION THAT YOU MAY FIND UNDESIRABLE OR OBJECTIONABLE. THE School DISCLAIMS ANY LIABILITY FOR UNAUTHORIZED USE OR REPRODUCTION OF ANY PORTION OF THE WEB SITE. ACCESSING THE CONTENT FROM TERRITORIES WHERE IT MAY BE ILLEGAL IS PROHIBITED. This Agreement is effective until terminated by the School, with or without cause, in the School’s sole and unfettered discretion. The School may terminate this Agreement without notice to You if You fail to comply with any of its terms. Any such termination by the School shall be in addition to and without prejudice to such rights and remedies as may be available to the School, including injunction and other equitable remedies. The disclaimers, limitations on liability, ownership, termination, interpretation, Your license to the School, Your warranty and the indemnity provisions of this Agreement shall survive the termination or expiry of this Agreement. You agree at all times to indemnify, defend and hold harmless the School, its agents, suppliers, affiliates and their respective directors and employees against all actions, proceedings, costs, claims, damages, demands, liabilities and expenses whatsoever (including legal and other fees and disbursements) sustained, incurred or paid by the School directly or indirectly in respect of: (i) any information or other content You provide on or through this web site or which is sent to the School by e-mail or other correspondence; or (ii) Your use or misuse of the Content or this web site, including without limitation infringement claims The School, this web site and the Content (excluding linked web sites or content) are physically located within The United Kingdom. This Agreement will be governed by the laws of The United Kingdom. In the event of a dispute, We agree to submit to the jurisdiction of the British courts."}
{"id": 98, "text": "The division of this Agreement into sections and the insertion of headings are for convenience of reference only and shall not affect the construction or interpretation of this Agreement. In this Agreement, words importing the singular number include the plural and vice versa, words importing gender include all genders; and words importing persons include individuals, sole proprietors, partnerships, corporations, trusts and unincorporated associations. All references to money amounts in this Agreement, unless otherwise specified, are in GBP These terms and conditions and any and all legal notices on this web site constitute the entire agreement between You and the School with respect to the use of this web site and the Content. No supplement, modification or amendment to this Agreement and no waiver of any provision of this Agreement shall be binding on the School unless executed by the School in writing. No waiver of any of the provisions of this Agreement shall be deemed or shall constitute a waiver of any other provision (whether or not similar) nor shall such waiver constitute a continuing waiver unless otherwise expressly provided. Any provision of this Agreement which is prohibited or unenforceable in any jurisdiction shall, as to that jurisdiction, be ineffective to the extent of such prohibition or unenforceability and shall otherwise be enforced to the maximum extent permitted by law, all without affecting the remaining provisions of this Agreement or affecting the validity or enforceability of such provision in any other jurisdiction. This Agreement shall inure to the benefit of and be binding upon each of Us and our respective successors and permitted assigns. You acknowledge having read this Agreement before accepting it, having the authority to accept this Agreement and having received a copy of this Agreement. © More House School 2014, United Kingdom. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction"}
{"id": 99, "text": "An outstanding achievement. Well done to all our talented performers!"}
{"id": 100, "text": "More House School considers the privacy of its users to be a serious issue. Please read the following to learn more about our privacy policy. More House School is a school based in the United Kingdom This policy covers how More House School treats personal information that More House School collects and receives, including information to your past use of our website. Personal information, is information about you that is personally identifiable like your name, address, email address or phone number, and that is not otherwise publicly available. This policy does not apply to the practices of companies that we do not own or control, or to people that we do not employ or manage. More House School collects personal information whenever a user chooses to contact us via the web form within the contact us section. When contacting us using this method we ask for information such as your name, e-mail address and telephone number. More House School automatically receives and records information on our server logs from your browser, including your IP address, More House School cookie information, and the page you request. We use information for the following general purposes: to customise the content you see, fulfil your requests and for technical web site administration purposes. We do not rent, sell or share personal information about you with other people or non-affiliated companies except to provide products or services you’ve requested, when we have your permission. We will use reasonable efforts to ensure that your personal data is not disclosed to regional/national institutions and authorities, unless required by law or other regulations. We may update this policy. We will notify you about significant changes in the way we treat personal information by placing a prominent notice on our web site. If you have any questions or suggestions, please contact us using the online form provided. 11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025"}
{"id": 101, "text": "We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
{"id": 102, "text": "11+ Open Evening – Wednesday 17 September 2025 11+ Open Morning – Friday 10 October 2025 We are thrilled to share the results from the recent LAMDA (London Academy of Music and Dramatic Art) exams, taken by our students on 1st May 2025. LAMDA’s grading scale: No Mark | Pass | Merit | Distinction An outstanding achievement. Well done to all our talented performers!"}
